[
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "4598 SHERMAN RD", "year_built": 1960, "bed": 4, "bath": 3, "ptype": "house", "price": 239000, "sqft": 2496, "description": "Beautiful home in a park-like setting, with the big ticket items already updated....resting in Brimfield Township, minutes from I-76 expressway! Updated eat-in kitchen with granite countertops, bartop seating and sliding glass doors to the deck overlooking the fenced in backyard. The first floor also offers a bedroom with private full bathroom (in-law suite), home office, spacious laundry room, sprawling family room, and another full updated bathroom. Upstairs you'll find three generously sized bedrooms, and a nicely updated full bathroom. Full walk-out basement with nice natural window light. The one side of the basement could be finished to make a huge rec. room or hobby shop! Pull through driveway leads to the oversized two car attached garage. Bonus 16x20 FINISHED detached building with electric, insulation, and windows - would make a great business office or get-away space! Major mechanicals are updated; new roof 2020, new heating system, new well pump, pressure tank and water softener, gutter guards with transferable warranty, and septic inspected annually per county requirements. This is a unique home and property, that has been well taken care of, with loads of space and a beautiful peaceful 1.1 acre lot. Come and schedule your private viewing today!"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "2855 OLD FORGE RD", "year_built": 1850, "bed": 4, "bath": 2, "ptype": "house", "price": 495000, "sqft": 2054, "description": "Absolutely amazing Gentleman's Farm! Start with an 1850's Picturesque farmhouse totally remodeled to current standards! Lovely open kitchen with new granite countertops and stainless appliances overlooking a beautiful 24x14 living room highlighting inlaid maple flooring and cozy fireplace. Lots of space to entertain! Large master suite with huge 11x10 walk in closet and private 25x6' balcony overlooking the entire farm. Home offers FREE Gas heat with Furnace and Central air updated 12 yrs. ago, Updated wiring, newer hot water heater. Outside is even better! Great outdoor area with connecting 25'x17' deck and 16x23' deck. Nearest the house is a 36x64 building w/ full In-Law Suite with kitchen, bathroom, living area, laundry, central air and FREE GAS HEAT! This building includes a separate 4 car garage with its own electric, plumbing, and heating built in 2006. Next is a 40x64 pole building with double 12' doors, 6\" thick concrete floors, half basketball court and separate 100 amp electric and water, built in 1993. Finally, is a 32x64 Pole building built in 2005 with 12' door, 6\" thick concrete floors, 100-amp service and water. Pasture has high tensile fencing ready for your cattle or houses! Impeccable landscaping, fire pits and a custom-built chicken coop and goat barn. All of this allows you to multi-purpose your own mini farm, business, hobbies, and country living at its best! Schedule your private viewing today! All mineral rights to transfer with home including FREE GAS!"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "1359 BROOKDALE LN", "year_built": 1960, "bed": 3, "bath": 2, "ptype": "house", "price": 145000, "sqft": 1426, "description": "COMPLETELY renovated 3 BR / 2 full BA ranch. Open floor plan with brand new white cabinets, granite, stainless steel appliances with a shiplap peninsula. Luxury vinyl flooring throughout the whole living area and new carpet in the spacious bedrooms. Tiled shower in the main bathroom - new modern vanities. Modern farmhouse fixtures throughout. Open sunroom offering plenty of natural light with cathedral ceilings overlooking the patio and fire pit in the backyard. Large cement patio for entertaining with a privacy fence. Fresh landscapes. 2 storage sheds! Field Schools. Roof (2020), Furnace (2020), A/C (2020) HWT (2020)."},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "517 SPAULDING DR", "year_built": 1970, "bed": 4, "bath": 2, "ptype": "house", "price": 145000, "sqft": 1368, "description": "Check out this wonderful value in Kent! This Bi-Level features a HUGE backyard that is completely fenced in that's also completed with a deck and a enclosed patio. Walk inside and you'll find 4 bedrooms and 2 full baths with master bedroom in lower level. Home also features a partially finished basement with exterior door access which is perfect for entertaining. Shopping, KSU, shopping and dining are all just minutes away. Bring your finishing touches and come see what all this home has to offer."},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "425 DODGE ST", "year_built": 1890, "bed": 3, "bath": 1, "ptype": "house", "price": 69850, "sqft": 1456, "description": "Rustic and charming with lots of potential for the price! Spacious living room and family room area, either could also be used as play room, dining area, whatever you wish! Two bedrooms on the first floor AND a full bathroom! Upstairs is a good sized bedroom and a loft area that could serve as an office or extra living space. Newer furnace 5 years, newer carpeting 9/2019, and low maintenance vinyl siding. Carport and 2 car garage, plus partially fenced large yard make the possibilities endless! Bring your paint brush and decorating ideas because this one will be gone super fast!!"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "2099 TALLMADGE RD", "year_built": 1965, "bed": 5, "bath": 3, "ptype": "house", "price": 149900, "sqft": 2240, "description": "Sprawling 2,200+ square foot, 5 bedroom, 3 bath ranch...on nearly three quarters of an acre. Great location off of Tallmadge Rd., in Brimfield township, with quick access to I-76, and shopping. Current owners have cared for this home for 30+ years and are ready to hand off to the next owners. Great covered front porch with skylights, and decorative pond. Three seasons room off of the back living room is a great escape! Wheelchair/handicap accessible. Large gravel 8 car parking area. Seperate entrance leading to master's suite - could be in-law suite or a second unit. Major mechanicals have been updated; New roof 2017, New furnaces and A/C 2018, updated well pump and pressure tank. (Property currently earns $100/mo for sign rental space in front yard). Move-in ready. Schedule your showing today!"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "644 MARILYN DR", "year_built": 1960, "bed": 3, "bath": 1, "ptype": "house", "price": 179900, "sqft": 1392, "description": "Easy living in this wonderful 1960 solid ranch home completed with hdwd flrs in bdrms, some built-ins, beautiful full brick wall gas fireplace, all the custom specialties like kitchen cupboard drawer inserts, bread box, Pantry, extra depth on all closets, and a large bathroom with great cabinet and linen space as well as a pocket door to create separation between water closet and vanity sink. The huge living room is showcased by the brick wall fireplace and another wall of very large windows inviting the outdoors in. The home is set in an amazing picturesque park setting, complete with your own path to the Summit Metro Bike and Hike Trail right behind your own treasure of a backyard. The location and backyard of this home is a dream for anyone loving the outdoors. Exciting bonus to the home is the fully screened in back porch to enjoy with friends and family or just sit back, relax, and watch the wild life! Marilyn is a loop Drive in a neighborhood with no outlet so traffic is minimum. You are located right on the Stow and Kent borders giving quick access to enjoy shopping and dining in both cities. LOCATION couldn't get any better! The basement offers more finished space awaiting your ideas of use, maybe a rec room, theater, or hobbies? Some updates over it's years of life are Anderson \"double pane\" casement windows, exterior painting, electrical panel, roof, the furnace and a/c are estimated to be around 10 yrs old. Very Gently lived in!"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "6279 2ND AVE", "year_built": null, "bed": null, "bath": null, "ptype": "lots land", "price": 45000, "sqft": null, "description": "Imagine the view from this lovely, elevated property! Imagine the home that could be built, taking advantage of the topography on this lot. Kent Park is a desirable neighborhood for many reasons: private and secluded, yet close to retail, KSU and vibrant downtown Kent. There are a few large evergreen trees remaining on the property, but the land is mostly cleared and ready for your new-build. Come check out one of the few remaining affordable lots in the area."},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "1184 LEONARD BOULEVARD", "year_built": 1955, "bed": 3, "bath": 2, "ptype": "house", "price": 146000, "sqft": null, "description": "Welcome to 1184 Leonard Blvd! This classic brick cape cod is a find. Begin each day in the eat-in kitchen overlooking the large, manicured yard. Three bedrooms - each cozy and ready for you to settle in and the first floor bathroom has been stylishly updated. The upstairs bedroom has fresh carpeting and its own convenient bath. Hardwood flooring and a stone fireplace are features of the large living room with sunny picture window. Details such as the arched doorway and coved ceiling give his home polish! &&\\n&&\\nThe driveway has been freshly surfaced and leads to a detached, brick two-car garage. Your basement level provides a large home office as well as your laundry."},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "MERRILL RD", "year_built": null, "bed": null, "bath": null, "ptype": "lots land", "price": 54900, "sqft": null, "description": "Build your dream home on this private wooded lot! Approximately 4 acres with plenty of room to explore and make memories. This lot backs up to Breakneck Creek, offering your own taste of outdoor living close to the local amenities that Kent has to offer. Natural gas is available on this street. This lot will need to be surveyed to determine property lines and annual taxes."},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "1477 CHERRYWOOD RD", "year_built": 1960, "bed": 3, "bath": 2, "ptype": "house", "price": 129900, "sqft": 1170, "description": "Stop The Car! Just move-in and unpack into this nicely updated adorable 3 bedroom, 2 full bath Ranch home. You won't be disappointed, everything has been done for you. You'll love the gigantic living room, having a Full Master bathroom and a large, very private backyard that backs up to the woods and offers a deck and fire pit to enjoy the outdoors. Easy access to I-76, Rt 43, Rt 18 and minutes from KSU. Close to shopping and restaurants. (New hot water tank 2019, roof 2012, furnace/Air 2009) newer windows."},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "414 RELLIM", "year_built": 1950, "bed": 3, "bath": 2, "ptype": "house", "price": 189000, "sqft": 1584, "description": "Amazing find in Kent. Updated kitchen, baths, appliances, privacy fenced yard. Spacious yard with shade trees. Quality through out. Wet bar in lower level. Extra storage. Fantastic location. Pet and Smoke free home"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "VERNER RD", "year_built": null, "bed": null, "bath": null, "ptype": "lots land", "price": 42900, "sqft": null, "description": "Large treed lot in Stow on the border of Stow and Kent. You won't find many this size left in Stow. 100' by 200'. Many homes in the area have wells. City sewer is at the street not on the lot. Come build your dream home here. Lot is the second lot to the left of 3323 Verner Rd."},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "465 DEIDRICK ROAD", "year_built": 1974, "bed": 3, "bath": 2, "ptype": "house", "price": 265000, "sqft": 1776, "description": "UPDATED/OPEN/NEUTRAL 3 BEDROOM HOME COMPLETE WITH 25 X 12 FINISHED LOWER LEVEL, WIDER/DEEPER/INSULATED 2-CAR GARAGE, COVERED MAINTENANCE-FREE FRONT PORCH, HUGE DECK, OVER-SIZED SHED/OUTBUILDING ALL ON ABSOLUTELY BEAUTIFUL/STUNNING/DEEP .50 WOODED ACRE LOT LITERALLY MINUTES TO MIDDLEBURY KAYAK/BOAT LAUNCH, FREEDOM TRAIL BIKE & HIKE TRAIL AND METRO/FIRST ENERGY BIKE & HIKE TRAIL (GOES TO PENINSULA--INCLUDES MOUNTAIN BIKE TRAILS/JUMPS IN WOODS!) ALSO LITERALLY 5 MIN TO BOTH NEWER STOW/KENT AND COLLEGE TOWN KENT/ACORN ALLEY SHOPPING PLAZAS & EATERIES!! HOME FEATURES INVITING FOYER; EXTRA-LARGE DINING ROOM WITH 6 RECESSED LIGHTS; TO-DIE-FOR CHEF'S DELIGHT GRANITE EAT-IN KITCHEN WITH DOUBLE PANTRY, DEEP 2-SIDED PREP SINK & DOUBLE-WIDE SUBWAY-TILED BACKSPLASH; OFFICE; LARGE FAMILY ROOM WITH BRUNCO WOOD-BURNING STOVE (COULD HEAT MOST OF HOME) & RECLAIMED BARN-BEAMED MANTEL OVERLOOKING BOTH KITCHEN & MULTI-WINDOWED SUN ROOM. 1/2 BATH. ENTIRE BACK OF HOME HAS DREAMY REAR VIEWS OF THE WOODED REAR YARD. HOME INCLUDES AWESOME OWNER SUITE WITH TWIN CLOSETS OVERLOOKING REAR YARD; 2 ADDITIONAL GREAT-SIZED BEDROOMS WITH EQUALLY GOOD-SIZED CLOSETS AND VERY COOL/SWANK COMMERCIAL GRADE MOSAIC/PORCELAIN-TILED BATH/SHOWER. NEWER HARDWOOD FLOORS THROUGH OUT EXCEPT FOR SUN ROOM AND BEDROOMS. AWARD-WINNING KENT SCHOOLS. LOCATION, LOCATION, LOCATION...BUT IT ALSO HAS ALL OF THE AMENITIES TOO!...BETTER THAN NEW CONSTRUCTION!! --NO SMALL GARAGE NOR POSTAGE-SIZED LOT--MAKE IT YOURS TODAY!!!"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "2805 OLD FORGE RD", "year_built": null, "bed": null, "bath": null, "ptype": "lots land", "price": 1100000, "sqft": null, "description": "This unique and rare 167 acre parcel is a REAL MUST SEE! The centerpiece of this secluded property is a beautiful 3-acre lake stocked with bluegill, hybrid bluegill, bass, perch, shellcrackers, crappie and amur. The lake includes a sand beach, 16x16 dock with Trex decking and a 25-foot windmill used to aerate the lake and prevent winter fish kill. Adjacent to the lake is a 12 ft x 24 ft custom-built cabin with wood burner and loft. A private 2000 ft. driveway will take you back to the center of the property and to the lake for a breathtaking view. For those looking to build their dream home, there are many amazing homesites especially by the lake. Approximately 75 acres of this parcel are tillable farmland which rents for $100.00 per acre per year. All the tillable acres are currently planted in hay and leased until 11-1-20. Over 90 acres are in woods. The Seller has been following a Timber Management Program developed by the Ohio Division of Forestry for the past several years and some timber is ready to harvest. This gorgeous property includes many features including a creek, rolling hills, flat lands, woodlands and a glacial peat bog with Tamarack trees. Abundant wildlife including deer (many big bucks have been harvested on this property), turkey, rabbits, pheasant and squirrel. This property is a recreational paradise where you can camp, hunt, fish and host family gatherings.All mineral rights transfer. There is one gas well on the property. (Photos coming!)"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "1213 GARTH DR", "year_built": 1971, "bed": 3, "bath": 3, "ptype": "house", "price": 185000, "sqft": 1690, "description": "WOW!! This beautiful home has been renovated from top to bottom with no detail left undone..! Open floor plan with all the modern twists! Lovely All New White Kitchen, Granite and SSt Appliances is the heart of the home and open to the Dining, Living rooms and Patio making this area perfect for entertaining. 3 New Baths! All New Waterproof LVT, Carpet AND Fresh Neutral Paint throughout this entire home! Upstairs find 3 Newly Appointed BR & All New Full Bath. On the Lower Level, every inch of space is used, a spacious FR w recessed lighting, a Modern Half Bath, and All New Laundry Area with New Shower and Laundry tub will give you the perfect drop off entering fm the Newly Painted Garage. 2020 New roof ! New Hi Eff Furnace, A/C, Pretty Patio and New Garage Door, 2015 Exterior Siding and HWT, Int & Ext Doors. Updated Electric Panel, 2015 windows, New 6 ft Fence surrounds the yard, with a gate opening directly to Al Lease Park, 31 acres of fishing, trails, sports fields, picnic areas and tranquil trees. Kent Schools, close to shopping, highways and all the Amazing Entertainment that Kent has to offer. Don't Wait, there simply is nothing left to do except MOVE IN!"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "3444 DEIDRICK RD", "year_built": 1950, "bed": 4, "bath": 2, "ptype": "house", "price": 169750, "sqft": 1961, "description": "SO MUCH TO LOVE ABOUT THIS BEAUTIFUL HOME, you WON'T want to miss it! Fabulous HUGE Lot makes you feel like you are living in the country but yet you are only minutes to shopping, restaurants, grocery stores, schools and parks! Newly rebuilt front porch with new front door greets you! Spacious living room flows into a formal dining area with hardwood flooring and fireplace! Good sized kitchen w/freshly painted white, bright cabinets, appliances that stay and an eat in area perfect for seating 2-4. Two good sized bedrooms on first floor and an updated full bathroom w/new tub surround, lighting and vanity. Upstairs you'll find two more bedrooms w/brand new carpeting, updated lighting, a second full bathroom and an additional space that can be used as an office/craft area. Utility room on first floor w/laundry provides storage space and access to backyard. Mudroom/breezeway connects main house to two car attached garage (added in 2018)! Updates include newer vinyl siding, windows, a/c, newer exterior light fixtures, carpeting, fresh gravel in drive and WHOLE house has been freshly painted/professionally cleaned! Backyard is perfect for entertaining with a large concrete patio w/pergola and plenty of space to play plus there's a shed to store all your yard equipment. Got pets? There's even a fenced kennel area behind the garage! Truly nothing to do but move in and enjoy this gorgeous home!"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "2805 OLD FORGE RD", "year_built": null, "bed": 0, "bath": 0, "ptype": "lots land", "price": 1100000, "sqft": null, "description": "This unique and rare 167 acre parcel is a REAL MUST SEE! The centerpiece of this secluded property is a beautiful 3-acre lake stocked with bluegill, hybrid bluegill, bass, perch, shellcrackers, crappie and amur. The lake includes a sand beach, 16x16 dock with Trex decking and a 25-foot windmill used to aerate the lake and prevent winter fish kill. Adjacent to the lake is a 12 ft x 24 ft custom-built cabin with wood burner and loft. A private 2000 ft. driveway will take you back to the center of the property and to the lake for a breathtaking view. For those looking to build their dream home, there are many amazing homesites especially by the lake. Approximately 75 acres of this parcel are tillable farmland which rents for $100.00 per acre per year. All the tillable acres are currently planted in hay and leased until 11-1-20. Over 90 acres are in woods. The Seller has been following a Timber Management Program developed by the Ohio Division of Forestry for the past several years and some timber is ready to harvest. This gorgeous property includes many features including a creek, rolling hills, flat lands, woodlands and a glacial peat bog with Tamarack trees. Abundant wildlife including deer (many big bucks have been harvested on this property), turkey, rabbits, pheasant and squirrel. This property is a recreational paradise where you can camp, hunt, fish and host family gatherings. All mineral rights transfer. There is one gas well on the property. (Photos coming!)"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "3444 DEIDRICK RD", "year_built": 1950, "bed": 4, "bath": 2, "ptype": "house", "price": 169750, "sqft": 1961, "description": "SO MUCH TO LOVE ABOUT THIS BEAUTIFUL HOME, you WON'T want to miss it! Fabulous HUGE Lot makes you feel like you are living in the country but yet you are only minutes to shopping, restaurants, grocery stores, schools and parks! Newly rebuilt front porch with new front door greets you! Spacious living room flows into a formal dining area with hardwood flooring and fireplace! Good sized kitchen w/freshly painted white, bright cabinets, appliances that stay and an eat in area perfect for seating 2-4. Two good sized bedrooms on first floor and an updated full bathroom w/new tub surround, lighting and vanity. Upstairs you'll find two more bedrooms w/brand new carpeting, updated lighting, a second full bathroom and an additional space that can be used as an office/craft area. Utility room on first floor w/laundry provides storage space and access to backyard. Mudroom/breezeway connects main house to two car attached garage (added in 2018)! Updates include newer vinyl siding, windows, a/c, newer exterior light fixtures, carpeting, fresh gravel in drive and WHOLE house has been freshly painted/professionally cleaned! Backyard is perfect for entertaining with a large concrete patio w/pergola and plenty of space to play plus there's a shed to store all your yard equipment. Got pets? There's even a fenced kennel area behind the garage! Truly nothing to do but move in and enjoy this gorgeous home!"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "4830 BROWER TREE LN", "year_built": 2016, "bed": 4, "bath": 3, "ptype": "house", "price": 319900, "sqft": 2420, "description": "Please check out this newly listed beautiful two story house located in the Sugar Maple Hills subdivision in Brimfield, OH! The house was built in 2016, and has had 1 owner. The house features a beautiful stamped concrete patio, fenced in back yard, oversized front concrete driveway and more!. The basement is partially finished, and has a roughed in bathroom. The house will include the following appliances: refrigerator, dishwasher, stove, microwave, washer/dryer, freezer in basement. The sectional couch in the basement will be included as well. This house is located just minutes from I-76 and Downtown Kent. Set up your showing today to see this beautiful home!*****This property is Agent owned*****"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "439 MAJORS LN", "year_built": 1991, "bed": 4, "bath": 3, "ptype": "house", "price": 269000, "sqft": 2385, "description": "Custom built, welcoming, spotless and meticulously maintained are a few words to describe this 4 bedroom home. Enter the hard wood, open foyer to find the incredible great room accented with a beautiful gas fireplace and built ins. French doors lead you to a vaulted sun room with hardwood floors and plenty of windows creating for an abundance of natural light. The spacious kitchen offers plenty of cabinet and counter space, has under cabinet lighting, is open to the eating/dining area, and offers a pantry, corian counters and newer refrigerator and gas stove. The first floor also features the master bedroom/full bath with walk in shower, laundry, and office or den. The office could be a 5th bedroom if needed. Six panel solid hard wood doors, wide moldings and taller than normal baseboards are extra features unique to this home. You will not believe the walk in closets in 2 of the bedrooms on the 2nd level (one is 14 x 7 and another 18 x 10)! The finished lower level is extremely nice as well and has a full bath, wet bar, cedar closet and utility sink room. Off the sun room is a nice deck with private backyard, patio and built in gas grill to enjoy this summer. Newer shed. If you are looking for first floor living, this home is a must see. Home warranty is offered for peace of mind. Updates include: New carpeting on steps and 2nd floor - June, 2020; Gas stove - Sept, 2017; Shed - May, 2015; Leaf Fitter Gutter Guard - May, 2013; Furnace and AC - 2011; Roof- 2004"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "4087 CHAPMAN DR", "year_built": 2002, "bed": 3, "bath": 3, "ptype": "house", "price": 244900, "sqft": 1627, "description": "Welcome to 4087 Chapman Dr in lovely Brimfield! This stunning Colonial in the Chapman Farms Subdivision features 3 bedrooms, 2.5 baths with 1st floor laundry and a 2 car attached garage with opener, situated on a nicely sized level lot. Entering the home you will notice the gleaming laminate wood flooring, a formal living room and dining room, plus an open concept eat-in kitchen and family room with access to both the patio and screened in porch. A half bath and conveniently located laundry room complete the first level. Make your way upstairs and you will find the generously sized master bedroom with vaulted ceilings, en suite bath, as well as two additional bedrooms and another full bath. Plantation Style blinds throughout the home. The full basement is perfect for storage or could easily be finished for an additional living space. This home has it all! Tons of updates include new roof 6/1/2020, New 90+ furnace & A/C 6/6/2020, composite deck 2019, gutter guards 2019, water heater 2019, sump pump 2019, gas logs 2017, granite/wood countertops with under mount sink 2018, lower patio 2019, stainless appliances 2018, Pergo Floors 2005, Security system, Carrier UV light. Schedule your private showing today!"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "1929 PINE DR", "year_built": 1977, "bed": 3, "bath": 4, "ptype": "condominium", "price": 265000, "sqft": 2983, "description": "Serenity awaits you at this spectacular 3,000 sf 3 bedroom, 3.5 bath ranch condo with loft in the Pines 1 condo subdivision in Franklin Township, Kent OH. Here you will find mostly neutral colors, and every bedroom boasting an ensuite full bath. You will fall in love with the soaring vaulted ceiling with rustic cedar beam in the 19 x 30 expansive great room with gas fireplace flanked by well crafted built-in curio cabinets. The first floor spacious master bedroom adjoins a fireplaced office or sitting room through pocket doors and has a walk-in closet. The other bedroom on this level also sports a walk-in closet. Each of the main level living areas of the property have sliders to the outdoors, patios or screened porch making entertainment and enjoyment of the surroundings a breeze. Upstairs find the natural light filled loft bedroom suite with vaulted ceiling and huge windows. Sit on your rustic screened porch and enjoy the view of the association-maintained green space. Amenities are many including Lake Royale privileges for small craft/fishing. One year home warranty paid by the seller for the new owner. Come home to life of ease and enjoyment in this private and serene community conveniently located a few minutes from Kent, Streetsboro, SR480 and I-80"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "415 CHERRY ST", "year_built": 1900, "bed": 2, "bath": 1, "ptype": "house", "price": 125000, "sqft": 1184, "description": "415 Cherry Street Kent, OH 44240. This is a large 2 bedroom,1 bathroom home in a great location. Whether this is owner occupied or a rental investment you will enjoy the location of the home with a large yard and a large block garage in the rear. The garage has 3 overhead doors and is currently a woodworking shop, art studio and storage space. Close to the wonderful downtown Kent area for close proximity to the many shopping and eateries in the area. Great home for owner occupancy or for 2 college students or a family, or as an investment for rental with closeness to Kent State. Don't miss out, this will not last!"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "1118 LAKE MARTIN DR", "year_built": 1990, "bed": 4, "bath": 4, "ptype": "house", "price": 399000, "sqft": 4280, "description": "You must see to fully appreciate this beautiful and spacious home with a contemporary flair. After recent upgrading, your new home is move in ready! The open floor plan invites for easy gatherings, while the flexible & smart layout also provides lots of privacy and can easily adapt to your needs. The 2-story open foyer leads to a beautiful great rm accented by a cathedral ceiling with skylights & a wall of windows providing for an abundance of natural light. The marble double sided gas fireplace, separating the great rm and the dining area, creates the perfect ambiance for all seasons. The stylish built-in granite bar can serve anytime! The lg. welcoming kitchen features custom cabinets, granite counters, desk, & SS appliances. Enter the master suite thru french doors to find dbl closets, spacious en'suite bath w/ dbl vanity & walk-in shower. Enjoy a beverage on the private deck from your master suite or great room overlooking the backyard. Another bedroom, full bath, powder room, laundry rm and lots of closet space completes the 1st floor. The LL provides much flexibility and generous space that can be used to meet your needs including rec room, bonus rm, 2 bedrooms, office, full bath, 2 doors to deck, & storage. A circular driveway w/ covered front entrance, 3+ car garage w/ extra high ceiling add to the appeal & functionality of this home. This property offers Lake Martin Privileges. Recent updates include HW flooring, carpeting, powder room & more-see attached (2020)"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "526 SANDY LAKE RD", "year_built": 1995, "bed": 2, "bath": 3, "ptype": "house", "price": 299000, "sqft": null, "description": "Welcome Home to 526 Sandy Lake Road. This charismatic 2 bedroom, 3 full bath country conventional situated on nearly 2.5 scenic acres, is nestled in the southeast corner of Brimfield Township, with convenient access to Route 43, Route 44, I-76, & I-77, making for a shortened commute to downtown Akron or ample avenues to Akron Fulton International Airport, Kent State University, numerous parks/lakes, and all the amenities this rural locality has to offer! This extraordinary rustic retreat boasts nearly 2,300 finished sq. ft. between all three levels, and comes complete with gorgeous cedar wood ceiling throughout, an insulated 2,000 square foot/6-car attached outbuilding (heated/air conditioned), manicured landscaping, multiple chainlink fully-fenced areas, 15 x 15 enclosed hot tub room (hot tub 2016), 38 x 25 pool room w/30 x 16 in-ground pool (newer roof, pool cover, & freshly sanded/stained interior), brick paver walkway/patio w/fire pit, multiple concrete patio areas (one is covered), and a massive wraparound deck perfect for taking in the amazing 180 degree views/scenery. The main level features an abundance of natural light, a garage conversion ready to be finished, full bath, bedroom, and vaulted great room w/fireplace open to the eat-in kitchen. The upper level offers a lofted master suite overlooking the great room. The finished lower level features a rec room, area for a second kitchen, laundry room, full bath, and area for housing mechanicals (HWT 2018)."},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "1065 JESSIE AVE", "year_built": 1955, "bed": 4, "bath": 2, "ptype": "house", "price": 174900, "sqft": 1572, "description": "Fantastic Cape Cod is much larger than it looks! Pride of ownership is obvious when you enter this 4 bedroom, 2 bath home. There are many updates to including windows, quartz counter tops, appliances, back deck, and Furnace/ AC in 2018. The lower level rec room is perfect for entertaining, movie night, or play room for the kids. There is also room for exercise equipment or a crafting. All of this plus a ton of storage! Tired of the headache of where to put book bags, coats, shoes and boots? There is a breezeway connecting the garage to the home; perfect place to collect and organize coming or going from the house. The backyard is huge! Enjoy the newly built back deck over looking the large yard, also perfect for hosting a cookout. Call today for a showing!"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "2367 LYNN RD", "year_built": 2001, "bed": 3, "bath": 3, "ptype": "house", "price": 249900, "sqft": 2024, "description": "Take Social Distancing to a new level with this spacious Bi-level set privately on 1.63 acres. Home sits off the road majestically embracing the beautiful Brimfield skyline. Massive front yard provides plenty of space to play while a gradually sloping backyard provides lovely views, tons of open space, two sheds and a garden area. Inside, a ceramic tiled entry leads up to a spacious area graced with cathedral ceilings. The carpeted Great Room has a propane fueled fireplace and large picture window with unique transom. Conveniently located dining room has easy access to elevated portion of deck through a newer Pella slider. Recently updated Kitchen sports Kraftmaid Solid Maple Cabinets, Quartz Countertops, and Stainless-Steel Sink, and Faucet. Kitchen and Dining share stylish ceramic tile floor and get plenty of natural light from skylight. Vast Master Suite has trayed ceiling, dual closets, and 2 distinct niches. Master Bath has jacuzzi tub with ceramic tile accents, walk-in shower, dual vanities, and ceramic tile flooring. 2 additional bedrooms are amply sized and have appealing maple trimmed window seats. A nicely designed 2nd full bathroom rounds out main living area. Downstairs, a second family room acts as the man-cave and walks out to lower level deck and backyard. The lower level also includes a handy 1/2 bath as well as a laundry/utility room. Updates include: Deck Painting ('20), Geothermal Heating/Cooling System and Garage Doors ('19), Carpet, Paint and Kitchen ('17)"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "7472 FERGUSON ROAD", "year_built": 1995, "bed": 4, "bath": 6, "ptype": "house", "price": 990000, "sqft": 6204, "description": "A park like setting is just one of the things that makes this a spectacular house. Over 10 acres which includes a pond, picnic area, and patio make it perfect for entertaining either formal or family. Elegant and friendly foyer with a formal living room and dining room. Wide open staircase to the second floor, Large open kitchen with Corian countertop's and harvest table with granite countertop set off the custom built Schrock cabinets of Walnut Creek, newer appliances and custom made window blinds. Large family room with fireplace and fresh very desirable wall paint and custom made draperies. Sunken hearth room and a sun room over looking the pond's water fountain. First floor has a laundry room and a mud room room off the attached 4 car garage. Wet bar and office are both perfect for the work at home professional. Four large bedrooms with a master bath and huge closets. One guest bath and one Jack and Jill. Finished recreation room in the lower level perfect for the exercise equipment and home theater."},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "3679 ELMHURST CT", "year_built": 1960, "bed": 3, "bath": 2, "ptype": "house", "price": 110000, "sqft": 1111, "description": "Welcome to this adorable ranch home located in Field Local School District. This inviting abode offers 3 nicely sized bedrooms and 2 baths. There is a galley kitchen that comes fully applianced. There is a spacious fenced in back yard with a fire pit and storage shed. This home has been well maintained and is awaiting a new owner. Updates include central air in 2019, furnace in 2012, and roof in 2013. This would make a perfect starter home. Don't forget the attached garage. Stop looking and start packing. Call to schedule a showing today!!"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "1617 MORRIS RD", "year_built": 1967, "bed": 4, "bath": 3, "ptype": "house", "price": 220000, "sqft": 2266, "description": "This turn-key Kent, Ohio 4 Bed, 3 Bath huge bi-level is perfectly situated adjacent to Highland Park, effectively expanding the back yard (through picket gate) without the added lawn work! Granite kitchen, with wonderful glass/ceramic backsplash, generous 4-seater bar, has been ingeniously opened up, creating spacious kitchen/living/dining area! All 3 FULL baths have been given facelifts! Original hardwood throughout main level except kitchen. Newer low-maintenance composite deck is IMMENSE & turns entertaining into a cinch! Also from the deck, a view of nature that's peaceful and quieting. Full vinyl picket for fur babies or young ones. On-trend paint throughout! Family room w/ wood burning fireplace makes for a nice winter evening. Comfortable walk to Kent State University! Far enough from downtown to avoid the bustle, but close enough to walk to South side shopping or bike or walk to downtown. Routes 43, 261 and I-76 are all minutes away as are bike trails! Washer/Dryer included here! All of this and a 1-year warranty provided by the sellers for buyer peace of mind!"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "847 STONEWATER DR", "year_built": 2005, "bed": 3, "bath": 3, "ptype": "condominium", "price": 299900, "sqft": 1576, "description": "Stunning ranch condo with gorgeous pond views in The Lakes at Franklin Mills! Open Floor plan with vaulted ceilings boasts 2900+ sq. ft. of beautifully updated & well-maintained living space! Great Room with gas fireplace & bright skylights. Large eat-in, fully applianced Kitchen with staggered height cabinets, stone back splash, granite counters and a convenient breakfast bar. Dining Area opens to the Great Room. Newer engineered hardwood flooring in the main living area! Sun Room addition is the perfect place to relax and enjoy the beautiful view! First floor Laundry includes the washer and dryer, additional cabinet space and a utility sink. Owners suite includes a large walk-in closet w/orgaizer and attached full bath with soaking tub/shower with ceramic tile surround, double sinks with granite counter and stone flooring. Additional Bedroom and the main bath complete the 1st floor. Downstairs, you will discover a huge Family Room with wet bar that walks out to a large composite deck. An additional bedroom with a 11 X 11 walk-in closet w/organizer, full bath and a craft room and/or office. 2 car attached garage plus an extra long driveway that allows for convenient guest parking. Mechanical updates include A/C 2019, Hot Water Tank (2016). Great location close to shopping, downtown Kent and KSU! Hurry...This is the one you have been waiting for!"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "234 SHAW DR", "year_built": 2016, "bed": 2, "bath": 2, "ptype": "condominium", "price": 279900, "sqft": 1856, "description": "Just open the door and move into this exquisite turn key ranch with upgrades galore. Open floor concept, dramatic vaulted Great room that features gas log fireplace, ceiling fan. Enjoy the bright and airy 4 season sun room. Large dining room with beautiful custom barn wood feature wall. The chefs kitchen features a sun tunnel that brings in beautiful sunshine, granite counter tops, under cabinet lighting, breakfast bar, cabinets galore. First floor laundry and ample storage. Master bedroom suite is vaulted and boasts a beautiful master bath with double vanity, granite counter tops, private shower, linen closet and walk-in closet, ceiling sun tunnel brings in the natural light. The garage is heated and has an epoxy floor that makes the garage a sanctuary for your vehicles. Private views to enjoy on the patio. The home interior has just been professionally painted, the upgrades included in this build were spectacular. Just move in and say I'm home! The community provides exclusive access to the Clubhouse, heated pool, a 24/7 fitness center and a beautifully furnished social room complete with full entertainers kitchen, billiards, large screen TV and many hosted social events throughout."},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "211 CHERRY ST", "year_built": 1970, "bed": null, "bath": null, "ptype": "house", "price": 310000, "sqft": 4735, "description": "FOR SALE OR LEASE: Commercial building in a prime location in Kent, OH situated on a .72 acre corner lot. Retail storefront, most recently a beer & wine homebrew supply store, and in the past has hosted telecom wireless and tool rental business'. High traffic count at the corner of Cherry Street and Franklin Ave., one block west of State Route 43 / two blocks North of 261...and catty corner the Kent Plaza. The interior of the building hosts a large retail area, a spacious back production/warehouse room with two garage doors, mens & womens bathrooms, small offices, and several garage storage bays. Plenty of parking out front along with a fenced in parking lot to the rear. Restaurant & Bar owners; current owners have just about put in place the winery license & A1-A2 permit (exempt from liquor license and permitted to sell beer, wine, distilled spirits), which a future owner can run with! This property would also be suitable for a mechanic shop, tow yard, storage facility, or any other retail business storefront which seeks loads of interior and exterior storage area and prime location! Call agent today to schedule your private viewing."},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "2721 LYNN RD", "year_built": 1960, "bed": 3, "bath": 3, "ptype": "house", "price": 249900, "sqft": 1672, "description": "Do you need a separate \"in-law suite\" or full apartment? Do you want privacy and a few acres? If so, you have just come to the right house! Click the link above that will take you to a 3D virtual tour of the home. This lovely ranch offers 3 bedrooms upstairs (owners suite has a half bath), and an additional bedroom and living space with a kitchen off the garage on the lower level. There is a fireplace in the eat in kitchen. An office off the kitchen keeps the new \"work from home\" people quiet away from the rest of the house, yet close enough to multi-task. How about the bonus that the house gets free gas since there is a gas well on the property? It also feeds a natural gas home generator that comes with the home! The current owner made many repairs and changes to the home since they bought it. Here is your opportunity to get county living, yet stay close to everything."},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "5885 THORNDALE DR", "year_built": 2003, "bed": 5, "bath": 4, "ptype": "house", "price": 349900, "sqft": 3628, "description": "Welcome home to 5885 Thorndale Dr. located in the desirable community of Willow Ridge, Kent Ohio. Tucked away in Franklin Township, this custom-built home has so much to offer. As you walk to the front door you are greeted by the warm and inviting front porch where you can enjoy your morning coffee, or an evening conversation. The kitchen is the perfect place for entertaining with it's large center island, beautiful solid cherry cabinets and open dining area where you can also walk out to the patio with a custom built pergola and the quiet wooded back yard. Off the kitchen is the study with glass panel doors and a closet perfect for a home office or den. The living room could be a separate quiet spot or open up the pocket doors to the family room with tons of natural light with its wall of windows. The 3 car garage could easily be 4 in tandem and has its own staircase to the basement and door out to the backyard. The mudroom/drop zone also has a door to the back yard and plenty of hooks and closet space along with a 1/2 bath. Upstairs features 5 bedrooms, Master suite 2nd floor laundry, 3 full baths and plenty of storage. The 5th bedroom could easily be a large recreation space too. The basement which has poured wall foundation and high ceilings, has tons of possibilities and comes plumbed for a full bath. All this and close to the university, downtown, hike and bike trail as well as Chase Park. Ask for a list of highlights as there are far too many to list!"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "780 AKRON BLVD", "year_built": 1964, "bed": 6, "bath": 4, "ptype": "multi family", "price": 139900, "sqft": 2592, "description": "Very Rare Solid duplex in great condition. One unit is occupied with long term month-to-month section-8 tenant - rented at $850 per month. Each unit has it's own driveway and attached garage. 1/2 Bath is on the first floor and full bath on the second. The bedrooms are well sized. The vacant unit has newer flooring and new flooring in Kitchen and entry way. Both units have separate basements and meters. This is a nice duplex that is close to all the amenities just minutes away. good solid income duplex...Fell out of escrow because buyer got cold FEET"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "825 SANDY LAKE RD", "year_built": 1860, "bed": 3, "bath": 2, "ptype": "house", "price": 185000, "sqft": 1461, "description": "Gorgeous 1.8 acres surrounds this 3 possible 4 bedroom, 2 bath farmhouse colonial. Second floor bath with laminate floor and barn door. Open country kitchen with wood burner. Bedroom #3 is currently being used as a closet. 1st floor laundry/bath with ceramic tile and claw foot tub. Deck and porch stained (2020). Built in bunk bed that will convey. Detached 1 car garage has extra room for storage. Office can be converted to 1st floor bedroom with access to 1st bath/laundry. Close to 76, Kent, and shopping. $44.98 per year assessment for solid waste and storm water are included."},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "1396 HOWE RD", "year_built": 1948, "bed": 3, "bath": 1, "ptype": "house", "price": 125000, "sqft": 1260, "description": "Very difficult to find move-in ready three-bedroom homes, in this market at a reasonable price... but here you have one! Nice floor plan with all your necessities; kitchen, laundry, bathroom, and master bedroom on the first floor. Beautifully updated kitchen and bathroom! Living room to the front of the home, and formal dining room. Contemporary colors and flooring. Spacious third bedroom upstairs could also make a nice recreation room. One car detached garage. Resting on just shy of a one acre lot, in Brimfield township & Field schools. Quick access to I-76 and downtown Kent. Call today to schedule your private viewing!"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "432 IRMA ST", "year_built": 1901, "bed": 3, "bath": 1, "ptype": "house", "price": 84000, "sqft": 1443, "description": "Attractive home on a beautiful treed and private lot. The home features a spacious kitchen, two bedrooms on the first floor along with a full bathroom. The second floor has a third bedroom along with an additional room that leads into the bedroom. The covered breezeway adds a nice touch the home. Property sold AS IS. Equal housing opportunity. FHA insurable w/escrow per HUD appraisal."},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "890 MARILYN DR", "year_built": 1968, "bed": 3, "bath": 2, "ptype": "house", "price": 165000, "sqft": 1744, "description": "Welcome Home! This unique home has all the room a person could ask for! Nice sized rooms with so many possibilities. The living area has a majestic wood burning fireplace for cold Ohio winters and central air to keep you cool during the summer months. The family room has access to the back patio with a view of a well manicured backyard, and to bring some of the greenery of outdoors inside, there is a fabulous brick planters box separating the kitchen and family room area. Roof and windows replaced within the last 5 years. New hot water heater. Kitchen flooring replaced in 2019. 2 1/2 car garage with abundant storage. All this house needs is your modern touches to make it the perfect place to call home."},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "3916 STATE ROUTE 43", "year_built": 2017, "bed": 3, "bath": 2, "ptype": "house", "price": 259900, "sqft": 1760, "description": "Looking for move in ready first floor living, convenient location yet peaceful and expansive outdoor space? Well look no further! This beautiful property is 3 years young, and was built with low-maintenance in mind. Leaf gutter protection means no spring clean out, and the bonus feature of a Generac whole house generator provides peace of mind in case of power outages. The property is completely handicap accessible, starting with ground-level front entry, a ramp in the garage, and wide doorways to all rooms. The open concept living space in the center of the home includes a spacious kitchen that will make most home chefs ecstatic! There is a large center island opposite the high-end Heartland range that makes food prep a breeze. In the master bedroom, two large closets provide ample room for clothing & the master bath is separated by an attractive barn door. A zero entry shower in the master bath adds to the accessibility factor. Two additional bedrooms can be found on the opposite side of the home, along with the second bathroom. Walk through the french doors from the eat-in kitchen & you will find a peaceful, covered patio with open space and trees to provide that much needed tranquility. Did I mention convenient location? In less than 1 mile, you can be on I76 and 2.5 miles gets you to the Cascades of Brimfield with ample shopping & restaurants There's no such thing as a perfect property, but this one is pretty close! Don't wait; schedule your showing today!"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "571 PERRY ST", "year_built": 1925, "bed": 4, "bath": 1, "ptype": "house", "price": 94500, "sqft": 1385, "description": "Welcome home to this spacious Colonial tucked away near the end a quiet, cul-de-sac street! So much bigger than it looks from the curb! Enjoy a large and newly updated kitchen with loads of cabinet and counter space. Fresh modern paint colors. Newer flooring throughout. Totally remodeled bathroom with a walk in shower. Continue towards the back of the home and find a great dining room and/or flex space, complete with a screened in sunroom out to the quiet back yard. Enjoy 2 first floor bedrooms as well as 2 second floor bedrooms! Huge walk in attic space adds tons of storage. 1+ car attached garage and a great size shed. Fresh paint and brand new carpet throughout! Convenient access to all Kent has to offer! This well cared for home is an absolute Must See!"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "1012 RAVENNA RD", "year_built": 1965, "bed": 3, "bath": 3, "ptype": "house", "price": 229900, "sqft": 2653, "description": "Tri level split with newer roof on a lovely lot, pretty as a picture! Windows and siding is updated. Vaulted living room and dining room. Family room has gas fireplace with sliders to sunroom overlooking beautiful back yard. lots of storage in basement."},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "3668 RANFIELD RD", "year_built": 1975, "bed": 3, "bath": 2, "ptype": "house", "price": 199480, "sqft": 1386, "description": "Looking for an updated home on 1.5 acres of land? This home has it! Partially fenced backyard boasts a split rail fence lined with vinyl chain link fencing. There is a gate that leads a little bridge to walk across a stream then to the remaining back of the yard that leads to the woods in the back. The owners have remodeled much of the home. The kitchen opens to the living room and dining area offering a great open feel. The cabinets are oak, granite countertops, recessed lighting. The refrigerator, microwave, range/oven and dishwasher will remain in the home. On the lower level is a spacious family room, great for entertaining or simply another place to enjoy in the home. There are vinyl replacement windows throughout the home. Newer laminate flooring in all bedrooms. The main level full bath and lower level half bath have both been remodeled. White raised panel doors. Some plumbing has been replaced. There is a water softener that will remain. Washer and dryer will remain. Beautiful, newer storage barn in the backyard. Newer 3 level deck. Don't miss out on this home!"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "4584 TULIP LN", "year_built": 2020, "bed": 4, "bath": 4, "ptype": "house", "price": 260000, "sqft": 2718, "description": "New construction in Brimfield with plenty of space, inside & out! Over 2715 square feet. Enjoy an evening sunset relaxing on your full front porch. A flex space when you enter can be a dining room, an open study, or living room. Past the stairs you'll enjoy the open-concept living areas of the home. The spacious great room boasts a gorgeous slate fireplace and 9 foot ceilings. The family room is open to the kitchen and dining area and perfect for entertaining. The kitchen features a huge, modern island with seating & pendant lights. Upper cabinets are 42\" tall maple cabinets & under cabinet lighting, granite countertops & stainless appliances. There is also a study on the first floor and large mud room. Upstairs, the owner's bedroom boasts dual closets. Three generously sized guest bedrooms, 2 of those having walk-in closets. You'll love the 2nd floor laundry room! Cranberry Creek is conveniently located close to I-76, Kent, Akron and area amenities. Sidewalks throughout and a community playground! Personalize the home finishes to your desire and take comfort with the Comprehensive Home Warranty. This home will have an Energy savings package that can save you up to 30% on your utility bills. To be built. Photos for illustration purposes only. Call To Set A Private Phone, Virtual, Or In-Person Appointment."},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "1414 RIVER TRAIL DR", "year_built": 1993, "bed": 3, "bath": 3, "ptype": "house", "price": 344900, "sqft": null, "description": "Amazing home in River Bend, with character, charm and updates! The inviting front porch is the perfect place to sit and enjoy your morning coffee. As you enter in to this warm home, you will be welcomed by the 2-story foyer and grand staircase. The large first floor office is perfect for a private study or even an additional bedroom. The dining room is situated with great flow to the kitchen and has the amazing character of an updated barn door and matching floors. The eat-in kitchen has updated granite counters and backsplash (2020) and has ample cabinets and breakfast island for additional sitting. The additional dining area overlooks the backyard and flows straight in to the vaulted living room, which is centered by the fireplace and charming port hole windows and skylights. The first floor laundry room is spacious and convenient and leads straight out to the backyard. All three bedrooms are located on the second floor, including the master suite with dual walk-in closets and completely updated full bathroom. The oversized bedroom above the 2-car garage is the perfect retreat for privacy and space. The full basement is ready for your finished touch! The backyard is an absolute oasis! It is fully fenced in, meticulously maintained, and has numerous paver patios throughout and a large deck. There are 2 sheds in the backyard, including an oversized shed that can be used as a workshop, storage or an additional living area. Call TODAY for your private tour of this amazing home!"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "3899 LOR RON ST", "year_built": 1963, "bed": 3, "bath": 2, "ptype": "house", "price": 155000, "sqft": 1092, "description": "Solid ranch home in Brimfield Lake Allotment. Over 1/2 acre with dozens of perennials in gardened areas. Back deck with built-in benches for view to woods and quiet sunset evenings. Deck is 14' by 16 '. Mature trees for shade and bird -watching. Home has oak flooring under most carpeted areas. High efficiency furnace and central air installed in May of 2020. Basement adds more living space with a large half bath that could readily have tub/shower added. Office, rec room and bar area could have updating to refresh this great lower-level living space. A walk down the street takes you to Brimfield Lake and Park with covered picnic pavilion and swings for the children. This is an appealing home and area. Much to appreciate here! Just add your own finishing touches. Close to Cascades Shopping area, local schools, community government center and I-76."},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "1003 CRESTVIEW CIR", "year_built": 2007, "bed": 3, "bath": 4, "ptype": "house", "price": 272500, "sqft": 2150, "description": "Back On The Market!! No fault of Seller...Surrounded by parks, walking trails and located on a quiet cul-de-sac, this beautifully updated 3 bedroom, 4 bathroom home boasts over 2150 square feet. Hardwood floors lead you into the open floor plan. An enclosed office/den with french doors is perfect for your study or home office. First floor laundry room recently updated with modern shelving and beautiful slate flooring. This space also serves as a walk in pantry if you should choose. A spacious eat in kitchen with hickory cabinets, granite counters, stainless appliances and an over-sized farm sink overlooks the living room that includes a gas fireplace for added ambiance and extra warmth on chilly evenings. Off of the kitchen, french doors lead you to the maintenance free deck with natural gas hookup and plenty of space for relaxing and entertaining. A half bath is conveniently located near front entrance.Upstairs you will find two large bedrooms and a full bathroom, along with the over-sized master suite with walk-in closet and bathroom that includes double vanity sinks and soaking garden tub for relaxation. In addition to the first and second floor living space, the basement is finished with a full bathroom and is ideal for a game room, additional living space, exercise room, office area, etc. The basement also includes lots of space for storage and an upgraded 80 gallon water tank. You'll feel right at home! Schedule your showing today!"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "508 ROOSEVELT ST", "year_built": 1950, "bed": 4, "bath": 3, "ptype": "house", "price": 184900, "sqft": 1392, "description": "Brick Cape Cod 4 Bedrooms 2 1/2 Baths 2 Car Garage Beautiful landscaping surrounds the house with beautiful secluded Patio in Backyard to enjoy those quiet moments when you want to relax, read a book or visit with friends Backyard is fenced in for privacy This home features a 1st floor Bedroom and a very cozy office if you have to work at home Hardwood floors in the Dining Room, Living Room, Office and 1st floor Bedroom Front Foyer is tiled and ready for visitors Upstairs has 3 Bedrooms and a 1/2 Bath with lots of storage Basement is partially finished with a cozy bar & sink and features new laminate flooring Get warm by the Pellet Stove which is fueled by pellets A storage pantry is also a nice feature Roof on both Garage and House was done in April 2006 New furnace April 2007 Pellet Stove was added in December 2008 Come and look at this beauty, it won't last long!"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "5076 STATE ROUTE 43", "year_built": 1942, "bed": 3, "bath": 1, "ptype": "house", "price": 129900, "sqft": 1392, "description": "Check out this cozy Cape Cod on a beautiful lot here in Brimfield Township. This 3 Bedroom/1 Bathroom home has so much to offer. Outside of the house you will find a 14X20 heated outbuilding, a 12X10 outbuilding, and an additional shed. Also outside of the home is a deck great for entertaining. Some updates include: Hot Water Tank 2016, New Carpeting 2013, New Roof 2011, and New Furnace 2009. Set up your showing today!"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "5076 STATE ROUTE 43", "year_built": 1942, "bed": 3, "bath": 1, "ptype": "house", "price": 129900, "sqft": 1392, "description": "Check out this cozy Cape Cod on a beautiful lot here in Brimfield Township. This 3 Bedroom/1 Bathroom home has so much to offer. Outside of the house you will find a 14X20 heated outbuilding, a 12X10 outbuilding, and an additional shed. Also outside of the home is a deck great for entertaining. Some updates include: Hot Water Tank 2016, New Carpeting 2013, New Roof 2011, and New Furnace 2009. Set up your showing today!"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "955 EDGEWATER CIR", "year_built": 2004, "bed": 5, "bath": 3, "ptype": "condominium", "price": 299400, "sqft": 2648, "description": "*Beautiful waterfront condo in The Lakes at Franklin Mills!* Enjoy the amazing view this condo offers from the large deck and the gorgeous sun room! Walk in the front door to high ceilings, hardwood floors and an open concept floor plan. Just off the foyer is a nice sized bedroom with hardwood floors and an updated full bathroom. The bathroom offers a quartz top vanity and ceramic tile flooring. The eat-in kitchen features beautiful quartz countertops, grey cabinets and new black stainless steel appliances. The great room has nice white built-in cabinets, a gas fireplace, and large windows providing a relaxing view. Just off the dining area is the sun room, which is the perfect place to enjoy your morning coffee! The master suite has vaulted ceilings, hardwood floors, and a large walk-in closet. The master bathroom has ceramic tile, a large garden tub and double vanity. Down to the lower level you will find a large finished area with access to the deck. The lower level features brand new carpet throughout, 3 additional bedrooms, an updated full bathroom, a large bar, and a huge recreation area. Each bedroom is a nice sized room with lots of natural light. The updated full bathroom has vinyl plank flooring and a quartz top vanity. There is also plenty of space for storage in the unfinished area. This condo has it all and won't last long! \r\nUpdates: Fridge, stove, microwave-2018 a/c-2017 updated kitchen-2016 Carpet-2020 *Brand new dishwasher coming*"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "1397 BROOKDALE LN", "year_built": 1960, "bed": 4, "bath": 2, "ptype": "house", "price": 126500, "sqft": 1170, "description": "Nicely updated four-bedroom family home! New fully applianced kitchen, open to dining and living areas! New flooring throughout, newer furnace and hot water heater. Two refurbished full baths and laundry area-washer and dryer included! Slider leads to concrete back patio and large fully fenced backyard. Two car garage with workbench and built-in shelving. Concrete front porch overlooks pretty and sort of private pine-treed front yard! Garage roof approx. 2 years. Home roof approx. 7 years."},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "371 ECKWOOD DR", "year_built": 1962, "bed": 3, "bath": 2, "ptype": "house", "price": 114900, "sqft": 1008, "description": "This 3 bedroom, 1.5 bath brick ranch sits on a dead-end street on a wooded half-acre lot. This is the perfect opportunity for anyone looking to invest in a fixer-upper! The handicap-accessible ramp leads you to the front entrance. Natural light pours into the living room from the large picture window. Many cabinets in the kitchen along with appliances that stay plus a half bath sits just off of the kitchen. Down the hall, you will find all three bedrooms and a full bathroom. Located just off of Mogadore Rd with easy access to highways and more. Schedule your showing today!"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "216 WEST ELM ST", "year_built": 1880, "bed": 2, "bath": 1, "ptype": "house", "price": 69000, "sqft": 734, "description": "Nice starter home or investment opportunity. Updated furnace and hot water tank. Very cute inside. Call today for showing. Tenant occupied."},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "591 SOUTH FRANCIS ST", "year_built": 1940, "bed": 2, "bath": 1, "ptype": "house", "price": 99500, "sqft": 776, "description": "Adorable 2 bed, move in ranch in Kent! Comes with oversized 1 car garage ( 2 parking places ) and 12x15 rear private deck, accompanied by a step down stone patio. All on a double lot with mature trees and foliage for some back yard fun! Main systems updates occurred near 2002. New Carpet, kitchen appliance upgrades and freshly painted interior. Right down the road is Longcoy Elementary. Close to Kent State University, the beautifully renovated campus district, shops, walking trails, restaurants and all it has to offer! Seller is providing a home warranty for added peace of mind."},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "614 HUDSON RD", "year_built": 1901, "bed": 3, "bath": 1, "ptype": "house", "price": 125000, "sqft": 1834, "description": "Welcome home to this charming colonial centrally located to downtown Kent. The home includes 1800 square feet, three bedrooms and one full bath. First floor laundry and two garage are our bonus features. Upgrades include new flooring, paint throughout. Renovated kitchen and bath. Exterior of home has been painted as well. This property is great for an investment property or owner occupant. Call/text for your private showing today!"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "224 SOUTH PROSPECT ST", "year_built": 1910, "bed": 3, "bath": 2, "ptype": "multi family", "price": 146900, "sqft": 1644, "description": "Charming 2 unit home with 2 bed/1 bath in lower level and 1bed/1bath in upper level is conveniently located close to KSU, downtown, shopping, and restaurants. The lower level offers 2 bedrooms, 1bath, living area, dining area and mud rm with storage. The kitchen has refrig, stove and dishwasher, gar disposal and access to basement with washer and dryer. The lower level also has access to 2 car garage w/ opener. The upper level offers eat-in kitchen with refig and stove, living area. spacious bath, bedroom and mud room and access to carport. Both units have window air conditioners and NEW Metal Roof was installed in 2019."},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "1316 AARONS WAY", "year_built": 1978, "bed": 3, "bath": 2, "ptype": "condominium", "price": 75000, "sqft": 1365, "description": "Great place to start or would make excellent rental property. Three bedrooms, 1 1/2 baths, full basement, fireplace, garage, deck and walk out basement. Close to expressway and be in Akron or Cleveland within minutes."},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "2875 OLD FORGE RD", "year_built": null, "bed": null, "bath": null, "ptype": "lots land", "price": 114900, "sqft": null, "description": "Nice open building lot surrounded by farm and fields. 150' frontage widens out to 450' for beautiful building site. Previously septic approved by Portage County but would need to be re-evaluated. Buyer to do own due diligence for all building site requirements. All mineral rights to transfer."},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "4925 BROWER TREE LN", "year_built": null, "bed": null, "bath": null, "ptype": "lots land", "price": 49900, "sqft": null, "description": "Level lot #7 in Sugar Maple Hills development in area of fine homes. Choose your own builder. Recreation is the playground & walking trail."},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "421 DODGE ST", "year_built": 1890, "bed": 3, "bath": 1, "ptype": "house", "price": 92900, "sqft": 1084, "description": "This home is an absolute doll house, tucked away in this close to downtown neighborhood and sitting on a private deep lot, this home has been updated inside and out and is ready for lucky new owners. This home has great curb appeal, but just wait until you get inside. The living room is a good space w/good natural light from the newer windows. The 1st floor bedroom is off the living room. The large bathroom has been redone with new flooring, vanity, tub surround and more, fresh and clean. The eat in kitchen with tons of cabinets has had a makeover as well, cabinets painted, new countertops, backsplash and flooring. And you will love the first floor laundry/mud area just inside the back door. There are two bedrooms up. You can have your master on the first floor or 2nd, both great size bedrooms. Updates include new house roof 2020, newer windows, electrical updates, flooring, paint and fixtures throughout, lots of drywall replacement, additional grouting to the concrete area around the base of the home. The concrete floor in the garage was replaced, garage painted, the waterline from the street to the house was replaced and so much more. The work is done here, get ready to move in and enjoy this home and this community for the summer."},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "POWDERMILL ROAD", "year_built": null, "bed": null, "bath": null, "ptype": "house", "price": 70000, "sqft": null, "description": "GREAT opportunity to own your private piece of paradise in Brimfield Township! This 4.62 acre lot features a long drive that opens up to beautiful pond views. Natural gas and public water available at the street. Call today to schedule a walk through!"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "1495 RIVER EDGE DR", "year_built": 1993, "bed": 4, "bath": 4, "ptype": "house", "price": 359900, "sqft": 2758, "description": "Welcome home to this custom-quality built home located in highly sought after River Bend neighborhood. Attention to detail is evident from the moment you step into the gracious two-story foyer. Flanking the foyer you will find a formal Dining Room and the expansive Living Room with French doors that flows into the Family Room. This room will become your favorite gathering spot with a uniquely designed brick fireplace with a raised hearth, mantel and built-in side bookcases. The spacious remodeled kitchen is a chef's dream with the huge middle island, granite countertops, SS appliances and maple cabinetry. There is also a large dinette area that easily accommodates casual dining. French doors off the FR leads to the light-filled, heated Sun Room with a cathedral ceiling offering a picturesque view of the old Oak Knolls golf course. A main floor laundry room and half bath round out the first floor. The inviting master suite features a walk-in closet and glamour bath with whirlpool tub & skylight. Three additional BR's and bath complete the second floor. The lower level has been professionally finished into a rec room and a full bath. Special features include extensive crown moldings , HW floors, 9 ft. ceilings and sprinkler system. This development has much to offer : close proximity to schools, river park access w/kayak launching and fishing, walking distance to community pool and tennis courts, easy access to hop on the Hike & Bike Trail, street lights and sidewalks."},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "MELOY ROAD", "year_built": null, "bed": null, "bath": null, "ptype": "house", "price": 190000, "sqft": null, "description": "Welcome to your private oasis! This gorgeous property offers frontage on Meloy and Powdermill- potential to parcel off an additional building lot in the future. The property features a beautiful pond, pavilion, inground pool and outbuilding. This is truly a one of a kind property. Adding your dream home on this land is a once in a lifetime experience. ***THE HOUSE IS A SEPARATE LISTING***"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "STATE ROUTE 43", "year_built": null, "bed": null, "bath": null, "ptype": "lots land", "price": 42900, "sqft": null, "description": "Almost 3 acres on the North side of the East Twin Lake! Tuck your new home back from the main road for plenty of privacy.Possible membership available to Twin Lakes Association, allowing access to both of the lakes as well as the amenities of both!Vacation living year 'round!"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "836 RAVENNA RD", "year_built": 1967, "bed": 5, "bath": 4, "ptype": "house", "price": 254000, "sqft": 3558, "description": null},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "4527 STATE ROUTE 43", "year_built": 1928, "bed": 4, "bath": 2, "ptype": "multi family", "price": 129900, "sqft": 2484, "description": "Property is on 1.268 acres of land. Great rental with some TLC. One unit has bedroom on 1st floor with dining room and living room, dorm style bedroom also available in this unit. 2 car garage in center. 2nd unit has living room, kitchen and 2 bedrooms with 1 full bath. Sellers are motivated."},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "5185 SUNNYBROOK RD", "year_built": 1960, "bed": 3, "bath": 3, "ptype": "house", "price": 100000, "sqft": 1848, "description": "Kent ranch with 3 bedrooms, 3 baths, large living room that opens to dining room and a nice size family room with fireplace and sliders to deck. Nice size bedrooms. Master with walk in closet. Lower level with potential for additional living space and sliders to patio and fireplace. This home is in need of updates and repairs. Subject to lender and court approval. Selling as is."},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "2051 EAST SWAN LAKE CIR", "year_built": 2003, "bed": 5, "bath": 5, "ptype": "house", "price": 567000, "sqft": 2991, "description": "Stunning 4-5 bedroom home, 4.5 Bathrooms, 4,586sf of finished area including walk-out lower level finished basement w/ bar & theater area, magnificent water views of the private waterway, home is located at 2051 East Swan Lake Circle in the Beautiful Twin Lakes area of Kent Ohio in highly sought after Lake Royale Development cul de sac lot. Bonus room over 3-car garage can be used as bedroom or additional recreation room. This stunning resort like home on the waters edge boasts a two story Great Room & wonderful stone accented gas fireplace wall. Master Bedroom & Master Bathroom are on the 1st floor with views of the water as well! Roomy kitchen w/ tons of cabinets & stainless steel appliances for the chef in you. Full walk-out basement includes an Entertainment area, full wet bar & bonus room can be an office as well as a 5th bedroom or home office. This spacious home also includes foyer, laundry room, garage entry from large 3 car garage, large deck as well as a concrete patio, workout room, private dock, gas fueled fire pit & bonfire area. In addition to all this prewired security system, Jucuzzi, 5 zone Audio system and it is pre-wired for both central vac and smarthome control. There's a private pond and pavilion owned by the Land Owners Association for this small Development's Owners use as well as Lake Royale that is a wonderful swimming lake featuring both a private swim dock & a fishing dock & is awesome for kayaking & paddleboarding! Coming Soon, showings start 2/23"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "5891 POWDERMILL RD", "year_built": 1958, "bed": 3, "bath": 2, "ptype": "house", "price": 219000, "sqft": null, "description": "This ranch is ready to move in with new paint, new carpet and lots of windows to let in the natural light. Use the wood burning fireplace in the living/dining room for the chilly winter nights. The family room is directly off the kitchen,but if you need more room for entertaining the lower level is completely finished with a full bath and access to the outside. There is a large heated workshop that is attached to the house garage. The large building in the back can be used for anything it has a 40X48 with 12 ft high ceilings and 2 large garage doors that is heated and has sodium lighting. The front of the building has 2 offices 10X15 and a 9X15 entry way. Above the offices is a 15X31 storage area. This property has so much to offer that your not going to want to miss out. It is located right down the road from the new Kent state golfing facility."},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "500 FAIRCHILD AVE", "year_built": 1901, "bed": 3, "bath": 1, "ptype": "house", "price": 71000, "sqft": 1382, "description": "Three bedroom Colonial located near downtown Kent. Minutes from Kent State University. Zoned Single family. Call today."},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "621 RUSTIC KNOLL DR", "year_built": 1999, "bed": 5, "bath": 5, "ptype": "house", "price": 650000, "sqft": 4733, "description": "SPECTACULAR 5 Bedroom/4 & 1/2 Bath Stone MASTERPIECE on almost 2 Acres of Private Scenic Land with 321 Feet of Cuyahoga River Frontage built in the DESIRABLE River Bend East with a FOUR CAR GARAGE. Home Include: DRAMATIC Front Entrance to AMAZING Foyer which leads to the EXCEPTIONAL Custom Kitchen with Cherry Cabinets, STUNNING Hardwood Floors, & Granite Counter Tops, Center Island, MASSIVE Pantry, Double Viking Ovens, and Breakfast Area. The Large Kitchen Area leads to the MAMMOTH Great Room with PHENOMENAL Stone Fireplace, WONDERFUL Wall of Windows, & Hardwood Floors, Front Library/Office Area with Gas Fireplace, Marble Hearth, and Built in Bookshelves, Formal Dining Room, and an AWESOME First Floor Laundry Room. 2nd Floor offers the Large Master Bedroom with Walk In Closet & Master Bath, 4 other Large Bedrooms with 2 Jack & Jill Baths. The 4-Tiered Back Deck was built to capitalize on the AMAZING Scenic Views plus a DRAMATIC Custom Water Fall. Home offers Front & Back Staircase to Second Floor for convenience plus two sets of stairs to the basement. The Completely Finished WALK OUT Basement offers a Family Room Area, Rec. Room, Bar, and even an Exercise Area. The Basement Walks out to the SENSATIONAL Back Brick Patio that leads you to the FABULOUS Back Yard that borders the Cuyahoga River. Upgrades Include the Fabulous Kitchen, New Carpet, New Windows, Updated Fixtures, Refinished Hardwood Floors, High End Stainless Steel Appliances, and a Fresh Coat of Paint!"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "810 LAKEVIEW CT", "year_built": 2008, "bed": 2, "bath": 2, "ptype": "condominium", "price": 207000, "sqft": 1612, "description": "Lovely condo close to Kent State and I76, yet tucked away in the quiet countryside. Open floor plan, granite countertops, high ceilings and a lovely office or sun room located behind the great room with soaring ceilings. 2 full bathrooms. Laundry room with closet and wash tub. 2 car attached garage. All appliances stay. Won't last! Come see for your self why this is such a special place!"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "434 STOW ST", "year_built": 1870, "bed": 3, "bath": 1, "ptype": "house", "price": 29900, "sqft": 2204, "description": "3 bedroom one bath house sold \" As Is \". House needs major repairs, structural repairs, updating, and cleaned out."},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "319 BOWMAN DR", "year_built": 1965, "bed": 3, "bath": 2, "ptype": "house", "price": 150000, "sqft": 1196, "description": "Beautiful solid brick ranch with 3 bedrooms, full bath upstairs and a bath in the basement. Original hardwood floors exposed on the main level. Home freshly painted, just move right in! Lots of extra space in the basement with room for a 11x42 family room for entertaining. Fenced in back yard with ever blooming flowers. New floating deck off the back of the house. Quiet street, just waiting for you to make it your own."},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "3687 RANFIELD RD", "year_built": 1953, "bed": 3, "bath": 2, "ptype": "house", "price": 167500, "sqft": null, "description": "Looking for land? Looking for privacy? Looking for a completely remodeled home? Don't miss this home. The freshly renovated home is just the touch of farmhouse and modern you've been looking for. The first floor includes a living room with large windows, eat-in kitchen with white cabinets, black stainless steel appliances, white subway tile backsplash and door to your large backyard. This first floor also offers a master bedroom with walk in-closet (and laundry hookups) and a master bathroom (master tub is tiled with white subway tile and multi-jet body sprayers). There is also another freshly renovated full bathroom on the first floor that also includes a tub with subway tile surround. Upstairs there are two nicely sized bedrooms with cathedral ceilings. 2 car detached garage with electric and door opener finish off this awesome property.. but did we mention 3.5 acres? Updates include in 2019; new siding and windows, new furnace and heat pump/AC, updated electric and electric panel, fully renovated kitchen and 2 full bathrooms, new plumbing, new flooring throughout, new lighting fixtures, new plumbing fixtures, new appliances, new doors and hardware, and so much more."},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "V/L STATE ROUTE 59", "year_built": null, "bed": null, "bath": null, "ptype": "lots land", "price": 895000, "sqft": null, "description": "Approx 25 acres in Franklin Township Subject to lot split approval"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "3854 WILLOW WAY", "year_built": 2012, "bed": 4, "bath": 3, "ptype": "house", "price": 289000, "sqft": 2384, "description": "This is a beautifully maintained home and is located on a cul de sac. You won't want to miss the opportunity to live in a newer home built in 2012. There are 4 bedrooms and 2.5 baths. As you enter the home you will notice the beautiful hardwood floors in the living room. The open floor plan leads you to the great room with a gas fireplace. The eat-in kitchen has granite countertops and is perfect for entertaining. There is a bright morning room surrounded by windows to enjoy your morning coffee. There is a spacious deck that overlooks the woods as well. The shed in the backyard stays. The home has 4 bedrooms on the second level and two full baths. The bathrooms have all been updated with granite. The master bath features double sinks and a garden tub. There is also an upstairs laundry room for your convenience. The basement area is finished for extra living area. There is a second laundry area in the basement and utility room for extra storage. Lets not forget the rare 3 car garage! You will see this home has so much to offer!"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "SUNNYBROOK RD", "year_built": null, "bed": null, "bath": null, "ptype": "lots land", "price": 64000, "sqft": null, "description": "4.737 acres vacant residential land. Irregular shaped lot, mostly wooded. Minutes from Kent, Ravenna, Rootstown, Cuyahoga Falls, and Akron. Easy access to I76! Soil test has been performed and the site has \"Extensive Suitable Soils for a Septic System.\""},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "3480 KESWICK DR", "year_built": 1960, "bed": 4, "bath": 2, "ptype": "house", "price": 118500, "sqft": 1170, "description": "Cozy ranch home with open floor feel to it. Walk outside into your backyard pergola and 2 car garage with cable already hooked up. Plenty of storage in the garage and also the shed."},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "1571 ELIZABETH CT", "year_built": null, "bed": null, "bath": null, "ptype": "lots land", "price": 125000, "sqft": null, "description": "Build your dream home on this picturesque wooded lot, located in a quiet cul-de-sac, in the desirable River Bend Development in Kent, Ohio. This is the only remaining lot in River Bend with a water front view of the Cuyahoga River. At the end of the street, there is entrance into the Portage Bike and Hike Trail. Another half block and you will be able to access the Parks and Recreation Project where you can partake in your favorite water activities! Close to the renovated downtown Kent area with wonderful restaurants and shopping. Gorgeous community; Peaceful cul-de-sac; View of the Cuyahoga River; This lot is truly a gem!"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "1855 HONEYCHUCK LN", "year_built": 2015, "bed": 3, "bath": 2, "ptype": "house", "price": 350000, "sqft": 2128, "description": "For more Information TEXT CH5111 to VIDEOS (843367). Wow! What a house! Stunning Ranch custom built by Touchstone Builders in 2015. Open floor plan boasts 2128 sq. ft. of living space! Engineered hardwood 5-inch plank flooring & 9 ft. ceilings in the living areas. Huge Great Rm. w/10 ft. coffered ceiling, custom, shaker style Amish built-ins, & stone fireplace. Gourmet kitchen w/ 3 X 9 island opens to the Great Rm. & features custom, shaker style Amish built cabinets (white cabinets w/gray island), quartz counters, farmhouse sink, stainless steel appliances & a fantastic walk-in pantry w/coffee bar & sink! Dining area w/french doors that open to the 12 X 12 covered porch which overlooks the gorgeous, fenced backyard & picturesque horse pasture behind the property. Master Bedroom w/bayed window featuring built-in storage drawers. Master bath w/custom, walk-in, ceramic tile shower, Amish cabinetry, double sinks, quartz counters, ceramic tile flooring & a large walk-in closet that even connects to the Laundry Rm.! Full, unfinished basement w/10 foot ceilings is pre- plumbed for a full bath - perfect for storage or future living space. 3 car attached garage with storage bay. Peaceful, country setting offers quick access to I-76, KSU, Neomed, Downtown Akron, Downtown Kent, shopping & restaurants! This is a must see!"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "1667 HONEYCHUCK LN", "year_built": null, "bed": null, "bath": null, "ptype": "lots land", "price": 70000, "sqft": null, "description": "Last home site in Country View Estates. Beautiful rolling lanes of upscale custom homes set in a neighborhood boastingan \"Open Space\" concept that sustains the \"Large Country Feeling\" throughout. This home site is nestled in a cul-de-sac ofthe final phase of Country View Estates. A wooded backdrop offers the rear yard privacy that you have been looking for.Looking for a neighborhood with low traffic past your home? Here it is.Call for deed restrictions and other documentation."},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "1106 JESSIE AVENUE", "year_built": 1957, "bed": 3, "bath": 2, "ptype": "house", "price": 169900, "sqft": 2488, "description": "Many recent updates in this open floor plan ranch. Roof 2017, deck 2017, furnace 2015, and most windows 2013. Amish built Schrocks of Walnut Creek cherry kitchen cabinets. Updated counter tops. Some original oak floors and some newer vinyl plank flooring.Additional finished room with full bath in basement. Rec room also with newer carpet. Seperate laundry room in basement. Sliding doors off family room to large newer deck. Wood fenced yard for pets, or privacy. Lots to offer in this move in ready home."},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "634 VINE ST", "year_built": 1910, "bed": 4, "bath": 2, "ptype": "house", "price": 139900, "sqft": 1376, "description": "Located within walking distance to Kent State University and the bus route, this property offers a living room, updated kitchen, bedroom and full bath on the first floor and three additional bedrooms and a full bath on the second floor. Good rental history."},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "327 CHERRY ST", "year_built": null, "bed": null, "bath": null, "ptype": "lots land", "price": 20900, "sqft": null, "description": "City lot with a garage. This property is ready for building a single family or a 2 family home. (Zoned R-3) Location is convenient to KSU, downtown Kent, Bus-Line, shopping, recreation center, elementary school and Plum Creek Park. Nice level lot. Lot extends to alley at the rear."},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "V/L CLINE RD", "year_built": null, "bed": 0, "bath": 0, "ptype": "lots land", "price": 300000, "sqft": null, "description": "Approx 8.5 acres made up of 3 parcels on Summit St and Cline Rd across from Dix Stadium. Zoned R-1 Low Density Residential."},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "V/L WEST CAMPUS CENTER DR", "year_built": null, "bed": 0, "bath": 0, "ptype": "lots land", "price": 125000, "sqft": null, "description": "Approx 16.2 acres on the east side of W. Campus Center Dr. Zoned University - with possibility of rezoning. Approx 1142 ft frontage on Campus Center Drive. Subject to new survey, legal description and lot split."},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "JACOBS LN", "year_built": null, "bed": null, "bath": null, "ptype": "lots land", "price": 45000, "sqft": null, "description": "Great location to build home! Highly desirable neighborhood at the end of a cul-de-sac. Electric, gas, and sewer available. Much of the lot is surrounded by other wooded land. Wetland in northwestern corner of property."},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "5036 STATE ROUTE 43", "year_built": null, "bed": null, "bath": null, "ptype": "lots land", "price": 950000, "sqft": null, "description": "Approx 43 acres on State Route 43. Zoned G-C General Commercial. Subject to new survey per Portage County. Sewer/Water/Gas/Electric/Cable (Buyers responsibility to verify accessibility, capacity, etc.. on all utilities). Call agent for additional info"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "V/L POWDERMILL RD", "year_built": null, "bed": 0, "bath": 0, "ptype": "lots land", "price": 312500, "sqft": null, "description": "Approx 25 acres south of railroad tracks on Powdermill Rd. Zoned R-1 Low Density Residential. Approx 1076 ft frontage on Powdermill Rd. Subject to lot split. Sewer & Water at street. Gas/Electric/Cable (Buyers responsibility to verify accessibility, capacity, etc.. on all utilities) Call agent for additional info"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "911 MAE STREET", "year_built": 1948, "bed": 2, "bath": 2, "ptype": "house", "price": 114900, "sqft": 1440, "description": "Charming ranch style 2 bedroom home with a 2 car detached garage. Amenities include front and back deck, hardwood flooring, . Being sold as-is. Agent is related to the Seller."},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "CLINE RD V/L", "year_built": null, "bed": null, "bath": null, "ptype": "lots land", "price": 300000, "sqft": null, "description": "Approx 8.5 acres made up of 3 parcels on Summit St and Cline Rd across from Dix Stadium. Zoned R-1 Low Density Residential."},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "POWDERMILL RD V/L", "year_built": null, "bed": null, "bath": null, "ptype": "lots land", "price": 312500, "sqft": null, "description": "Approx 25 acres south of railroad tracks on Powdermill Rd. Zoned R-1 Low Density Residential. Approx 1076 ft frontage on Powdermill Rd. Subject to lot split. Sewer & Water at street. Gas/Electric/Cable (Buyers responsibility to verify accessibility, capacity, etc.. on all utilities)Call agent for additional info"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "WEST CAMPUS CENTER DR V/L", "year_built": null, "bed": null, "bath": null, "ptype": "lots land", "price": 125000, "sqft": null, "description": "Approx 16.2 acres on the east side of W. Campus Center Dr. Zoned University - with possibility of rezoning. Approx 1142 ft frontage on Campus Center Drive. Subject to new survey, legal description and lot split."},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "1257 MELOY RD", "year_built": null, "bed": null, "bath": null, "ptype": "lots land", "price": 59000, "sqft": null, "description": "Approx 8 acres on Meloy Rd zoned R-1 Low Density Residential. Approx 756 ft frontage on Meloy Rd."},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "320 BOWMAN DR", "year_built": 1960, "bed": 3, "bath": 2, "ptype": "house", "price": 125000, "sqft": 1284, "description": "A Must see home! Covered back patio creates a serene feeling . Refrigerator, dishwasher, garbage disposal, furnace and washer machine are newer appliances. Real Hardwood floors in Bedrooms, Hallway, dining room and living room. Being Sold As Is condition."},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "7457 KNOLL RD", "year_built": 1925, "bed": 3, "bath": 2, "ptype": "house", "price": 229900, "sqft": 1877, "description": "Staying at home is so much sweeter when you make this charming 1920's home yours! You will feel as if you have entered your own private Bed and Breakfast the moment you enter through the front door. Original architectural details can be found throughout, including hardwood floors, built-ins and arched windows. The bonus room off the master bedroom is perfect for a nursery, a home office or sitting room for the master suite. Situated on over a half acre at the corner of a quiet cul-de-sac, this home is just a few houses from the private community access to the beach, beach house, boat launch and docks at West Lake. Additionally, you will have access to the resident docks on East Lake for fishing or launching canoes, kayaks and row boats. Do not miss this opportunity to make Twin Lakes your community!"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "1295 HOWE RD", "year_built": 1986, "bed": 4, "bath": 2, "ptype": "multi family", "price": 189000, "sqft": 1739, "description": "Come check out the circle duplex located in Brimfield! This is a prime opportunity to own this beauty and lease out the other unit, or utilize for a family member! The owner has done some updating with new flooring and paint. These are all electric units, with the shady trees outside, these stay cool inside throughout summer too! Both units offer appliances (stove, fridge, washer and dryer), the lower unit offers the well pump and softener. New gravel driveway, large firepit out back for some relaxation time. This is a one of a kind duplex and it's open for investment opportunities, it can bring in up to $1700+ a month when fully occupied. Make your appointment today before this one is gone!"},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "714 IVAN DR", "year_built": 1968, "bed": 3, "bath": 4, "ptype": "house", "price": 229000, "sqft": 2453, "description": "MUCH to love in this Kent, Ohio split! It starts with Curb Appeal and Setting... on the edge of Kent's Highland Park which becomes an extension of your yard without the maintenance! WOW... only a few homes in Kent can offer you that! Location demands your attention--walking distance to Kent State University, accessible to south-side shopping, restaurants, close to Routes 261,43 & 76! This turn-key property offers large shaded deck, doggie door into outside fenced area w/ dog house, original restored hardwood in living room & wide entry hall (as well as hardwood under all bed carpets if one is interested in exposing). The built-ins, closets, and overall storage--incredible! Enjoy the open concept granite kitchen with nicely-kept cabinets into great room w/ gas fireplace and vaulted ceiling and--the most incredible part--amazing windows to the back yard~! Newer paint throughout, new on-trend carpeting in all bedrooms. Above-grade lower level family room w/ new laminate flooring/paint offers a full window for plenty of light, wood burning fireplace & MORE great storage! MABR has en suite Bath; both full baths boast skylights. Newer Washer/Dryer included! There's so much more... Information from the seller in MLS Supplements will help to round out the story, as well as taking a virtual walk via the MLS 360 Virtual Tour. A 1-year home warranty is provided by the seller for buyer's peace of mind. Don't miss your chance to live in one of Kent's favorite neighborhoods!"}
]