[
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "Bowman", "year_built": 1962, "bed": 3, "bath": 2, "ptype": "Single Family Home", "price": 1133, "sqft": 1332, "desc": "This listing is For Sale by Owner. Some owners may offer special financing, like Rent to Own. Even though a homeowner chooses FSBO to save money on real estate fees, those savings can be passed on to the buyer as a lower purchase price. Some FSBO homeowners may also offer flexible financing options, including Owner Financing (a good alternative to a bank loan) or Rent to Own. The Rent to Own option would allow you to rent this home for a period of time with an option to purchase it for a predetermined price after the rental period. This gives you time to build up your credit and accumulate your down payment, all while living in the home of your dreams!", "nbhd": "Downtown Kent"},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "7472 Ferguson Rd", "year_built": 1995, "bed": 4, "bath": 6, "ptype": "Single Family Home", "price": 990000, "sqft": 5204, "desc": "A park like setting is just one of the things that makes this a spectacular house.  Over 10 acres which includes a pond,  picnic area, and patio make it perfect for entertaining either formal or family. Elegant and friendly foyer with a formal living room and dining room.  Wide open staircase to the second floor,   Large open kitchen with Corian countertop's and harvest table with granite countertop set off the custom built Schrock cabinets of Walnut Creek, newer appliances and custom made window blinds.  Large family room with fireplace and fresh very desirable wall paint and custom made draperies.  Sunken hearth room and a sun room over looking the pond's water fountain.  First floor has a laundry room and a mud room room off the attached 4 car garage.  Wet bar and office are both perfect for the work at home professional.  Four large bedrooms with a master bath and huge closets.  One guest bath and one Jack and Jill.  Finished recreation room in the lower level perfect for the exercise equipment and home theater.", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "Stinaff", "year_built": 0, "bed": 0, "bath": 0, "ptype": "Raw Land", "price": 20000, "sqft": 0, "desc": "Great build able lot. Additional lot availiable and adjacent to this. price at $43,000 for both S/L 167 Near KSU and freeways.", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "Stinaff", "year_built": 0, "bed": 0, "bath": 0, "ptype": "Raw Land", "price": 25000, "sqft": 0, "desc": "Buildable lot on nice street in Kent. Near KSU and freeways. Additional lot availiable and adjacent to this. price at $43,000 for both S/L 167", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "3679 Elmhurst Ct", "year_built": 1960, "bed": 3, "bath": 2, "ptype": "Single Family Home", "price": 110000, "sqft": 1111, "desc": "Welcome to this adorable ranch home located in Field Local School District.  This inviting abode offers 3 nicely sized bedrooms and 2 baths.  There is a galley kitchen that comes fully applianced.  There is a spacious fenced in back yard with a fire pit and storage shed.  This home has been well maintained and is awaiting a new owner.  Updates include central air in 2019, furnace in 2012, and roof in 2013.  This would make a perfect starter home.  Don't forget the attached garage.  Stop looking and start packing.  Call to schedule a showing today!!", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "465 DEIDRICK ROAD", "year_built": 1974, "bed": 3, "bath": 2, "ptype": "Single Family Home", "price": 279900, "sqft": 1776, "desc": "UPDATED/OPEN/NEUTRAL 3 BEDROOM HOME COMPLETE WITH 25 X 12 FINISHED LOWER LEVEL, WIDER/DEEPER/INSULATED 2-CAR GARAGE, COVERED MAINTENANCE-FREE FRONT PORCH, HUGE DECK, OVER-SIZED SHED/OUTBUILDING ALL ON ABSOLUTELY BEAUTIFUL/STUNNING/DEEP .50 WOODED ACRE LOT LITERALLY MINUTES TO MIDDLEBURY KAYAK/BOAT LAUNCH, FREEDOM TRAIL BIKE & HIKE TRAIL AND METRO/FIRST ENERGY BIKE & HIKE TRAIL (GOES TO PENINSULA--INCLUDES MOUNTAIN BIKE TRAILS/JUMPS IN WOODS!  ALSO LITERALLY 5 MIN TO BOTH NEWER STOW/KENT AND COLLEGE TOWN KENT/ACORN ALLEY SHOPPING PLAZAS & EATERIES!! HOME FEATURES INVITING FOYER; EXTRA-LARGE DINING ROOM WITH 6 RECESSED LIGHTS; TO-DIE-FOR CHEF'S DELIGHT GRANITE EAT-IN KITCHEN WITH DOUBLE PANTRY, DEEP 2-SIDED PREP SINK & DOUBLE-WIDE SUBWAY-TILED BACKSPLASH; OFFICE; LARGE FAMILY ROOM WITH BRUNCO WOOD-BURNING STOVE (COULD HEAT MOST OF HOME) & RECLAIMED BARN-BEAMED MANTEL OVERLOOKING BOTH KITCHEN & MULTI-WINDOWED SUN ROOM. 1/2 BATH.  ENTIRE BACK OF HOME HAS DREAMY REAR VIEWS OF THE WOODED REAR YARD.  HOME INCLUDES AWESOME OWNER SUITE WITH TWIN CLOSETS OVERLOOKING REAR YARD; 2 ADDITIONAL GREAT-SIZED BEDROOMS WITH EQUALLY GOOD-SIZED CLOSETS AND VERY COOL/SWANK COMMERCIAL GRADE MOSAIC/PORCELAIN-TILED BATH/SHOWER. NEWER HARDWOOD FLOORS THROUGH OUT EXCEPT FOR SUN ROOM AND BEDROOMS.  AWARD-WINNING KENT SCHOOLS.  LOCATION, LOCATION, LOCATION...BUT IT ALSO HAS ALL OF THE AMENITIES TOO!...BETTER THAN NEW CONSTRUCTION!! --NO SMALL GARAGE NOR POSTAGE-SIZED LOT--MAKE IT YOURS TODAY!!!", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "890 Marilyn Dr", "year_built": 1968, "bed": 3, "bath": 2, "ptype": "Single Family Home", "price": 165000, "sqft": 1744, "desc": "Welcome Home!  This unique home has all the room a person could ask for!  Nice sized rooms with so many possibilities. The living area has a majestic wood burning fireplace for cold Ohio winters and central air to keep you cool during the summer months.  The family room has access to the back patio with a view of a well manicured backyard, and to bring some of the greenery of outdoors inside, there is a fabulous brick planters box separating the kitchen and family room area.  Roof and windows replaced within the last 5 years. New hot water heater.  Kitchen flooring replaced in 2019. 2 1/2 car garage with abundant storage.     All this house needs is your modern touches to make it the perfect place to call home.", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "439 Majors Ln", "year_built": 1991, "bed": 4, "bath": 3, "ptype": "Single Family Home", "price": 269000, "sqft": 2385, "desc": "Custom built, welcoming, spotless and meticulously maintained are a few words to describe this 4 bedroom home.  Enter the hard wood, open foyer to find the incredible great room accented with a beautiful gas fireplace and built ins.  French doors lead you to a vaulted sun room with hardwood floors and plenty of windows creating for an abundance of natural light.  The spacious kitchen offers plenty of cabinet and counter space, has under cabinet lighting, is open to the eating/dining area, and offers a pantry, corian counters and newer refrigerator and gas stove.  The first floor also features the master bedroom/full bath with walk in shower, laundry, and office or den.  The office could be a 5th bedroom if needed.  Six panel solid hard wood doors, wide moldings and taller than normal baseboards are extra features unique to this home.  You will not believe the walk in closets in 2 of the bedrooms on the 2nd level (one is 14 x 7 and another 18 x 10)!  The finished lower level is extremely nice as well and has a full bath, wet bar, cedar closet and utility sink room.  Off the sun room is a nice deck with private backyard, patio and built in gas grill to enjoy this summer. Newer shed.  If you are looking for first floor living, this home is a must see.  Home warranty is offered for peace of mind.  Updates include:  New carpeting on steps and 2nd floor - June, 2020; Gas stove - Sept, 2017; Shed - May, 2015; Leaf Fitter Gutter Guard - May, 2013; Furnace and AC - 2011; Roof- 2004", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "216 West Elm St", "year_built": 1880, "bed": 2, "bath": 1, "ptype": "Single Family Home", "price": 69000, "sqft": 734, "desc": "Nice starter home or investment opportunity. Updated furnace and hot water tank. Very cute inside. Call today for showing. Tenant occupied.", "nbhd": "Downtown Kent"},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "2721 Lynn Rd", "year_built": 1960, "bed": 3, "bath": 3, "ptype": "Single Family Home", "price": 249900, "sqft": 1672, "desc": "Do you need a separate \"in-law suite\" or full apartment?  Do you want privacy and a few acres?  If so, you have just come to the right house! Click the link above that will take you to a 3D virtual tour of the home.  This lovely ranch offers 3 bedrooms upstairs (owners suite has a half bath), and an additional bedroom and living space with a kitchen off the garage on the lower level.  There is a fireplace in the eat in kitchen. An office off the kitchen keeps the new \"work from home\" people quiet away from the rest of the house, yet close enough to multi-task.  How about the bonus that the house gets free gas since there is a gas well on the property?  It also feeds a natural gas home generator that comes with the home!  The current owner made many repairs and changes to the home since they bought it. Here is your opportunity to get county living, yet stay close to everything.", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "3782 Olmsby Dr", "year_built": 1977, "bed": 3, "bath": 2, "ptype": "Single Family Home", "price": 117500, "sqft": 864, "desc": "This house is the perfect starter home or investment property. Well built just add your own finishing touches. Priced to sell!", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "Deer Trace", "year_built": 2004, "bed": 3, "bath": 3, "ptype": "Condominium Unit", "price": 185000, "sqft": 1416, "desc": "The government sponsored agencies Fannie Mae or Freddie Mac own this property after foreclosing on the original owner. Fannie Mae and Freddie Mac are chartered by the U.S. government to help families of low- and moderate-income to become homeowners. A published list price is stated but any reasonable offer may be considered. Offers go through the published listing agent. This contact can provide more details about this property, as well as the current special financing programs that may be available through Fannie Mae or Freddie Mac.", "nbhd": "Brady Lake"},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "4650 Estes Dr", "year_built": 1973, "bed": 3, "bath": 2, "ptype": "Single Family Home", "price": 204900, "sqft": 1968, "desc": "Stunning updated 3 bedroom, 2 full bath home on a picturesque .72 acre wooded private property. This beautiful split level boasts an Open Floor plan that includes a large Vaulted Dining Room and Living Room with a handsome brick fireplace. Newer meticulous White Kitchen updated in 2017 that includes lots of cabinets, stainless steel appliances, and ceramic plank tile. Sliding doors open to the fantastic 3 Season Sunroom with gas fireplace and new laminate flooring. \nThe Sunroom offers stunning views of the private backyard. A large wood deck and a patio are perfect for outdoor entertaining. The backyard includes two sheds, one with electric, great storage and workshop space. The second floor includes a large Master Suite with two closets and a private bath including a tiled shower. Two more bedrooms and a second full tiled bath complete the second floor.  A finished lower level with access from the two-car garage boasts a large recreation space, a laundry room, and lots of storage. Additional Updates include... 2019 Hot Water tank, 2015 Waterproofing System, Garage Door and Opener, 2017 Furnace and A/C, newer trim and 6-panel doors throughout, 2020 New Carpet throughout most of the home. Newer Wood Privacy Fence, 2018,  surrounds the entire backyard. Truly a well cared for home.", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "636 Emich Dr", "year_built": 1970, "bed": 5, "bath": 4, "ptype": "Single Family Home", "price": 246500, "sqft": 2844, "desc": "This gorgeous 5 bed/3.5 bath Colonial in the heart of the much sought-after subdivision of Riverside is the perfect home for entertaining! Fresh paint inside & new roof in 2014, new furnace & AC in 2016, new carpet throughout & new garbage disposal in 2018, new sump pump in 2019 & new stove & dishwasher in 2020. USA Waterproofing did the basement in 2019 & lifetime warranty transfers to new owners. Walk through the front door & to the right is a huge eat-in kitchen w/ an unbelievable amount of counter/cupboard space, wine rack, island on wheels & pass-through window to the family room. To the left is an incredibly spacious formal living room & dining room. The dining room has French doors leading to a wrap-around deck/Pergola. The immense family room has a wood-burning fireplace w/ two additional sets of French doors leading to the deck. There is also a gazebo & large shed for additional storage. Master bedroom is enormous w/ cathedral ceilings & two walk-in closets. Master bath has tub/shower combo & jet-spa garden tub. There are four additional upstairs bedrooms; two of which have built-in shelves and/or closets; and two of which have cork walls to display messages, pictures & artwork. The basement has two bonus rooms; one of which has a wet bar. There is also a full bath and workshop/utility room. This home is close to the Summit Bike & Hike Trail, shopping, dining, public transportation, major highways, airports, institutions of higher learning and so much more!", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "234 Shaw Dr", "year_built": 2016, "bed": 2, "bath": 2, "ptype": "Condominium Unit", "price": 284900, "sqft": 1856, "desc": "Just open the door and move into this exquisite turn key ranch with upgrades galour . Open floor concept , Dramatic\nvaulted Great room that features gas log fireplace, ceiling fan. Enjoy the bright and airy 4 season sun room. Large\ndining room with beautiful custom barnwood feature wall . The chefs kitchen features a sun tunnel that brings in\nbeautiful sunshine , granite countertops , under cabinet lighting , breakfast bar, cabinets galour. first floor laundry\nand ample storage. Master bedroom suite is vaulted and boasts a beautiful master bath with double vanity , granite counter tops, private\nshower ,linen closet and walk in closet, ceiling sun tunnel brings in the natural light. the garage is heated and has an\nepoxy floor that makes the garage a sanctuary for your vehicals. Private views to enjoy on the patio.\nThe home interior has just been professionally painted , the upgrades included in this build were spectacular. Just\nmove in and say I'm home! The community provides exclusive access to the Clubhouse , heated pool, a 24/7 fitness\ncenter, and a beautifully furnished social room complete with full entertainers kitchen, billiards, large screen TV, and\nmany hosted social events throughout", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "415 Gougler Ave", "year_built": 1835, "bed": 4, "bath": 2, "ptype": "Multi-family", "price": 1, "sqft": 1491, "desc": "AUCTION - One duplex on river.  PUBLIC AUCTION AUG. 1, 2020 @ 10:00 am.  \"AS-IS\" , WHERE AS WITH NO REPRESENTATIONS OR WARRANTIES.  A 10% Buyers premium to be added to bid to establish sales price, 10% deposit, balance in 30 days.  WILL BE SOLD SEPARATE & TOGETHER with  2nd auction @ 425 Gougler.  All information at auction takes precedent over listing information from sources to be true but not guaranteed.  PROPERTY WILL BE OPEN 1 HR. PRIOR TO SALE.", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "Newton Rd", "year_built": 0, "bed": 0, "bath": 0, "ptype": "Raw Land", "price": 69900, "sqft": 0, "desc": "Situated off Hudson Drive on Newton Road in Franklin Township, Kent, Ohio this awesome 1.5 acre property is grassed lawn in the front and partially cleared/mowed yet wooded in back. Land slopes to rear and west side of property. PERC soil test has been ordered/completed by buyer and is available from your realtor. Electric and gas at street. Well & septic to be installed by buyer. Build in the wooded or in front of them. Either way, build to suit on this gorgeous property! Buyer to perform due diligence re: Franklin Twsp &/or Portage County Building requirements/restrictions/easements/point of sale requirements before writing an offer to purchase. 167' of frontage & 423' depth. Handy to Kent and yet great country living!", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "591 South Francis St", "year_built": 1940, "bed": 2, "bath": 1, "ptype": "Single Family Home", "price": 99500, "sqft": 776, "desc": "Adorable 2 bed, move in ranch in Kent!  Comes with oversized 1 car garage ( 2 parking places ) and 12x15 rear private deck, accompanied by a step down stone patio.  All on a double lot with mature trees and foliage for some back yard fun!  Main systems updates occurred near 2002.  New Carpet, kitchen appliance upgrades and freshly painted interior.  Right down the road is Longcoy Elementary. Close to Kent State University, the beautifully renovated campus district, shops, walking trails, restaurants and all it has to offer!  Seller is providing a home warranty for added peace of mind.", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "1397 Brookdale Ln", "year_built": 1960, "bed": 4, "bath": 2, "ptype": "Single Family Home", "price": 126500, "sqft": 1170, "desc": "Nicely updated four-bedroom family home! New fully applianced kitchen, open to dining and living areas! New flooring throughout, newer furnace and hot water heater. Two refurbished full baths and laundry area-washer and dryer included! Slider leads to concrete back patio and large fully fenced backyard. Two car garage with workbench and built-in shelving. Concrete front porch overlooks pretty and sort of private pine-treed front yard! Garage roof approx. 2 years. Home roof approx. 7 years.", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "5076 State Route 43", "year_built": 1942, "bed": 3, "bath": 1, "ptype": "Single Family Home", "price": 135000, "sqft": 1392, "desc": "Check out this cozy Cape Cod on a beautiful lot here in Brimfield Township. This 3 Bedroom/1 Bathroom home has so much to offer. Outside of the house you will find a barn and two additional sheds. Also outside of the home is a deck great for entertaining. Some updates include: Hot Water Tank 2016, New Carpeting 2013, New Roof 2011, and New Furnace 2009. Set up your showing today!", "nbhd": null}
]