[
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "2051 East Swan Lake Cir", "year_built": 2003, "bed": 5, "bath": 5, "ptype": "Single Family Home", "price": 567000, "sqft": 2991, "desc": "Stunning 4-5 bedroom home, 4.5 Bathrooms, 4,586sf of finished area including walk-out lower level finished basement w/ bar & theater area, magnificent water views of the private waterway, home is located at 2051 East Swan Lake Circle in the Beautiful Twin Lakes area of Kent Ohio in highly sought after Lake Royale Development cul de sac lot. Bonus room over 3-car garage can be used as bedroom or additional recreation room. This stunning resort like home on the waters edge boasts a two story Great Room & wonderful stone accented gas fireplace wall. Master Bedroom & Master Bathroom are on the 1st floor with views of the water as well! Roomy kitchen w/ tons of cabinets & stainless steel appliances for the chef in you. Full walk-out basement includes an Entertainment area, full wet bar & bonus room can be an office as well as a 5th bedroom or home office. This spacious home also includes foyer, laundry room, garage entry from large 3 car garage, large deck as well as a concrete patio, workout room, private dock, gas fueled fire pit & bonfire area. In addition to all this prewired security system, Jucuzzi, 5 zone Audio system and it is pre-wired for both central vac and smarthome control. There's a private pond and pavilion owned by the Land Owners Association for this small Development's Owners use as well as Lake Royale that is a wonderful swimming lake featuring both a private swim dock & a fishing dock & is awesome for kayaking & paddleboarding! Coming Soon, showings start 2/23", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "3349 Old Forge Rd", "year_built": 1927, "bed": 5, "bath": 2, "ptype": "Single Family Home", "price": 190000, "sqft": 1835, "desc": "Remodeled 5 bedroom home on over 1.5 acres! Convenient, flexible spaces on main floor include large living area open to dining room, 2 bedrooms, updated full bath, updated kitchen with tile back splash and laundry on first floor. Lots of beautiful natural light! 3 bedrooms and a updated full bath on second floor. New flooring, carpet and fresh paint throughout! Garage and large outbuilding provide TONS of possibilities and potential to store all of your equipment and toys or have a hobby/workshop . There is no heat source on the property at this time. Heating is being changed from propane to electric. *Tenant is using space heaters temporarily until changeover is made* Out buildings include: Pole Barn 50 X 28 total area 1400 sf; Garage 24 X 24, total area 576 sf, Shed 18 X 14, total area\n252 sf. Easy access to Rt 76.", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "V/L 3rd Ave", "year_built": 0, "bed": 0, "bath": 0, "ptype": "Raw Land", "price": 25000, "sqft": 0, "desc": "A remarkable treed lot that is almost a 1/3 of an acre.  With 100' of frontage, you can pick your spot.  Bring your own builder, or ask and we can help you find one.  This is an established neighborhood in the Brady Lake area of Franklin Township.", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "634 Vine St", "year_built": 1910, "bed": 4, "bath": 2, "ptype": "Single Family Home", "price": 139900, "sqft": 1376, "desc": "Located within walking distance to Kent State University and the bus route, this property offers a living room, updated kitchen, bedroom and full bath on the first floor and three additional bedrooms and a full bath on the second floor. Good rental history.", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "327 Cherry St", "year_built": 0, "bed": 0, "bath": 0, "ptype": "Raw Land", "price": 20900, "sqft": 0, "desc": "City lot with a garage. This property is ready for building a single family or a 2 family home. (Zoned R-3) Location is convenient to KSU, downtown Kent, Bus-Line, shopping, recreation center, elementary school and Plum Creek Park. Nice level lot. Lot extends to alley at the rear.", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "5891 Powdermill Rd", "year_built": 1958, "bed": 3, "bath": 2, "ptype": "Single Family Home", "price": 229000, "sqft": 0, "desc": "This ranch is ready to move in with new paint, new carpet and lots of windows to let in the natural light. Use the wood burning fireplace in the living/dining room for the chilly winter nights. The family room is directly off the kitchen,but if you need more room for entertaining the lower level is completely finished with a full bath and access to the outside. There is a large heated workshop  that is attached to the house garage. The large building in the back can be used for anything it has a 40X48 with 12 ft high ceilings and 2 large garage doors that is heated and has sodium lighting. The front of the building has 2 offices 10X15 and a 9X15 entry way. Above the offices is a 15X31 storage area. This property has so much to offer that your not going to want to miss out. It is located right down the road from the new Kent state golfing facility.", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "621 Rustic Knoll Dr", "year_built": 1999, "bed": 5, "bath": 5, "ptype": "Single Family Home", "price": 650000, "sqft": 4733, "desc": "SPECTACULAR 5 Bedroom/4 & 1/2 Bath Stone MASTERPIECE on almost 2 Acres of Private Scenic Land with 321 Feet of Cuyahoga River Frontage built in the DESIRABLE River Bend East with a FOUR CAR GARAGE.  Home Include:  DRAMATIC Front Entrance to AMAZING Foyer which leads to the EXCEPTIONAL Custom Kitchen with Cherry Cabinets, STUNNING Hardwood Floors, & Granite Counter Tops, Center Island, MASSIVE Pantry, Double Viking Ovens, and Breakfast Area.  The Large Kitchen Area leads to the MAMMOTH Great Room with PHENOMENAL Stone Fireplace, WONDERFUL Wall of Windows, & Hardwood Floors, Front Library/Office Area with Gas Fireplace, Marble Hearth, and Built in Bookshelves, Formal Dining Room, and an AWESOME First Floor Laundry Room.  2nd Floor offers the Large Master Bedroom with Walk In Closet & Master Bath, 4 other Large Bedrooms with 2 Jack & Jill Baths.  The 4-Tiered Back Deck was built to capitalize on the AMAZING Scenic Views plus a DRAMATIC Custom Water Fall.  Home offers Front & Back Staircase to Second Floor for convenience plus two sets of stairs to the basement. The Completely Finished WALK OUT Basement offers a Family Room Area, Rec. Room, Bar, and even an Exercise Area.  The Basement Walks out to the SENSATIONAL Back Brick Patio that leads you to the FABULOUS Back Yard that borders the Cuyahoga River.  Upgrades Include the Fabulous Kitchen, New Carpet, New Windows, Updated Fixtures, Refinished Hardwood Floors, High End Stainless Steel Appliances, and a Fresh Coat of Paint!", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "319 Bowman Dr", "year_built": 1965, "bed": 3, "bath": 2, "ptype": "Single Family Home", "price": 150000, "sqft": 1196, "desc": "Beautiful solid brick ranch with 3 bedrooms, full bath upstairs and a bath in the basement. Original hardwood floors exposed on the main level. Home freshly painted, just move right in! Lots of extra space in the basement with room for a 11x42 family room for entertaining. Fenced in back yard with ever blooming flowers. New floating deck off the back of the house. Quiet street, just waiting for you to make it your own.", "nbhd": "Downtown Kent"},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "233 Lake St.", "year_built": 1901, "bed": 3, "bath": 2, "ptype": "Single Family Home", "price": 119900, "sqft": 1520, "desc": "Now is the perfect time to buy and enjoy this home featuring a gated, front porch, huge tiered deck, and completely fenced, large private back yard! A versatile floor plan and large rooms gives this \"old charmer\" character and appeal. The living room abuts an additional 10 x 9 area that could be office or den space. The main floor is complete with a large first floor bedroom and half bath, as well as a dining room and eat-in kitchen. The kitchen features cabinets galore plus 2 pantries and includes newer stainless appliances. The master bedroom includes two large closets and the third bedroom also has a walk-in closet. With a linen closet and additional hall walk-in closet, there is no lack of storage! The full basement comes with MORE storage, and laundry area complete with washer, dryer and utility sink. The 50 gallon water tank is newer, windows have been replaced, back roof done 5 years ago. The four window air conditioners will stay. Conveniently located just minutes to all that the \"new and improved\" downtown has to offer, and Kent State University. Don't pass this BUY! Call today to view.", "nbhd": "Downtown Kent"},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "2037 Old Forge Rd", "year_built": 1920, "bed": 5, "bath": 4, "ptype": "Single Family Home", "price": 510000, "sqft": 0, "desc": "This spacious, private country home includes 5 bdrms and 3.5 baths set on 18.5 acres featuring a natural pond, a walking path around the circumference of the property, a driving range, an in-ground pool, & a covered whirlpool hot tub. Extensive decks with an indoor/outdoor entertainment system & finished basement make this home perfect for entertaining. A huge master bedroom features a cathedral ceiling & an en-suite bath, an oversized walk-in closet, & 4 additional closets. The first floor bonus suite has its own full bathroom, private entrance, perfect for first floor living or guests. The kitchen is newly updated and features a sunny breakfast area in addition to the formal dining room. Additional features include an office with built-in shelving, fitness room with Nature Stone flooring, & first floor laundry. The enclosed front porch provides additional space for relaxing & bird watching. A home generator provides reassurance in the event of power outages. Taxes are for both parcels per tax records\nThis property includes its own oil/natural gas well - FREE natural gas to heat the house and pool, plus royalty income! Farm acreage provides another income opportunity. Two 45 x 90' pole barns plus a shed with adjacent fenced-in pets/animals complete the property. This home is move-in ready with fresh paint and carpet throughout. The home is close to Kent State University, NEOMED, and an easy commute to all of Northeast Ohio's major urban centers. Taxes are for both parcels.", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "1257 Meloy Rd", "year_built": 0, "bed": 0, "bath": 0, "ptype": "Raw Land", "price": 59000, "sqft": 0, "desc": "Approx 8 acres on Meloy Rd zoned R-1 Low Density Residential. Approx 756 ft frontage on Meloy Rd.", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "V/L West Campus Center Dr", "year_built": 0, "bed": 0, "bath": 0, "ptype": "Raw Land", "price": 125000, "sqft": 0, "desc": "Approx 16.2 acres on the east side of W. Campus Center Dr.  Zoned University - with possibility of rezoning. Approx 1142 ft frontage on Campus Center Drive. Subject to new survey, legal description and lot split.", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "V/L Cline Rd", "year_built": 0, "bed": 0, "bath": 0, "ptype": "Raw Land", "price": 300000, "sqft": 0, "desc": "Approx 8.5 acres made up of 3 parcels on Summit St and Cline Rd across from Dix Stadium.  Zoned R-1 Low Density Residential.", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "V/L Powdermill Rd", "year_built": 0, "bed": 0, "bath": 0, "ptype": "Raw Land", "price": 312500, "sqft": 0, "desc": "Approx 25 acres south of railroad tracks on Powdermill Rd.  Zoned R-1 Low Density Residential.  Approx 1076 ft frontage on Powdermill Rd.  Subject to lot split.  Sewer & Water at street. Gas/Electric/Cable (Buyers responsibility to verify accessibility, capacity, etc.. on all utilities)\nCall agent for additional info", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "W Main St", "year_built": 1970, "bed": 0, "bath": 0, "ptype": "Single Family Home", "price": 161500, "sqft": 0, "desc": "This property is Real Estate Owned, or REO. The property was foreclosed and repossessed by a lender when the owner failed to make payments. A bank is now the owner. Since banks are not in business to own homes, they are usually interested in selling foreclosed homes quickly at attractive low prices. A list price is published but reasonable offers can be submitted for consideration. Offers can be submitted through the official Listing Agent but in some cases, no agent is listed and offers can be submitted the bank owner directly.", "nbhd": "Downtown Kent"},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "Ravenna", "year_built": 1950, "bed": 3, "bath": 1, "ptype": "Single Family Home", "price": 150000, "sqft": 846, "desc": "This property is Real Estate Owned, or REO. The property was foreclosed and repossessed by a lender when the owner failed to make payments. A bank is now the owner. Since banks are not in business to own homes, they are usually interested in selling foreclosed homes quickly at attractive low prices. A list price is published but reasonable offers can be submitted for consideration. Offers can be submitted through the official Listing Agent but in some cases, no agent is listed and offers can be submitted the bank owner directly.", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "Garth", "year_built": 1969, "bed": 3, "bath": 1, "ptype": "Single Family Home", "price": 56300, "sqft": 1690, "desc": "This property is Real Estate Owned, or REO. The property was foreclosed and repossessed by a lender when the owner failed to make payments. A bank is now the owner. Since banks are not in business to own homes, they are usually interested in selling foreclosed homes quickly at attractive low prices. A list price is published but reasonable offers can be submitted for consideration. Offers can be submitted through the official Listing Agent but in some cases, no agent is listed and offers can be submitted the bank owner directly.", "nbhd": "Middlebury"},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "S Water St", "year_built": 1970, "bed": 0, "bath": 0, "ptype": "Single Family Home", "price": 50000, "sqft": 0, "desc": "This property is Real Estate Owned, or REO. The property was foreclosed and repossessed by a lender when the owner failed to make payments. A bank is now the owner. Since banks are not in business to own homes, they are usually interested in selling foreclosed homes quickly at attractive low prices. A list price is published but reasonable offers can be submitted for consideration. Offers can be submitted through the official Listing Agent but in some cases, no agent is listed and offers can be submitted the bank owner directly.", "nbhd": "Downtown Kent"},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "2006 Carlton Dr.", "year_built": 1970, "bed": 3, "bath": 2, "ptype": "Single Family Home", "price": 239900, "sqft": 1780, "desc": "Spacious split in a great location and large backyard has been impressively updated. New electric, furnace, A/C, flooring, bath and kitchen, siding, gutters, roof and more. What hasn't been done! Call Brian 330-715-2047", "nbhd": "Brady Lake"},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "319 Bowman Dr", "year_built": 1965, "bed": 3, "bath": 2, "ptype": "Single Family Home", "price": 150000, "sqft": 1196, "desc": "Beautiful solid brick ranch with 3 bedrooms, full bath upstairs and a bath in the basement. Original hardwood floors exposed on the main level. Home freshly painted, just move right in! Lots of extra space in the basement with room for a 11x42 family room for entertaining. Fenced in back yard with ever blooming flowers. New floating deck off the back of the house. Quiet street, just waiting for you to make it your own.", "nbhd": "Downtown Kent"},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "Biltz", "year_built": 1940, "bed": 3, "bath": 1, "ptype": "Single Family Home", "price": 70613, "sqft": 846, "desc": "The government sponsored agencies Fannie Mae or Freddie Mac own this property after foreclosing on the original owner. Fannie Mae and Freddie Mac are chartered by the U.S. government to help families of low- and moderate-income to become homeowners. A published list price is stated but any reasonable offer may be considered. Offers go through the published listing agent. This contact can provide more details about this property, as well as the current special financing programs that may be available through Fannie Mae or Freddie Mac.", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "Tallmadge Rd", "year_built": 1970, "bed": 0, "bath": 0, "ptype": "Single Family Home", "price": 0, "sqft": 0, "desc": "This property is Real Estate Owned, or REO. The property was foreclosed and repossessed by a lender when the owner failed to make payments. A bank is now the owner. Since banks are not in business to own homes, they are usually interested in selling foreclosed homes quickly at attractive low prices. A list price is published but reasonable offers can be submitted for consideration. Offers can be submitted through the official Listing Agent but in some cases, no agent is listed and offers can be submitted the bank owner directly.", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "764 Valley View Ct", "year_built": 2006, "bed": 3, "bath": 2, "ptype": "Condominium Unit", "price": 175000, "sqft": 1724, "desc": "Beautifully updated Condo in Brimfield is completely Move In Ready! This home has a great layout, with 3 Bedrooms, 2 Full Baths, a 2 car garage and is nestled at the end of an attractive street. There are many recent updates and upgrades that give this home the WOW factor! Walk in and be greeted by the vaulted living space recently done in stylish, modern neutrals.  The living area flows to the dining space, sliders to the patio, and on to the kitchen, a wonderful layout for living and entertaining. In the kitchen, white cabinets are paired with NEW Stainless Steel appliances including French Door Refrigerator, Glass top Convection Range, Microwave and Dishwasher! The entire home has recently been painted in SW New Gray, and all flooring is 2019, from the waterproof Shaw SouthHaven Oak wide plank, to the Mohawk Stainmaster with luxury pet padding, there is nothing for you to do except relax and enjoy your beautiful new home!  Additional Upgrades include a 2020 hot water tank, 2019 heat, and 2019 new driveway. Home warranty included for your peace of mind. This home is truly in move in condition and will be a delight for you to see, so come and check it out, you won't be disappointed! Located conveniently near I-76 and NEO-MED, and all the entertainment in Kent.   PS. HOA will allow white vinyl privacy fence at patio", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "421 Dodge St", "year_built": 1890, "bed": 3, "bath": 1, "ptype": "Single Family Home", "price": 92900, "sqft": 1084, "desc": "This home is an absolute doll house, tucked away in this close to downtown neighborhood and sitting on a private deep lot, this home has been updated inside and out and is ready for lucky new owners. This home has great curb appeal, but just wait until you get inside. The living room is a good space w/good natural light from the newer windows. The 1st floor bedroom is off the living room. The large bathroom has been redone with new flooring, vanity, tub surround and more, fresh and clean. The eat in kitchen with tons of cabinets has had a makeover as well, cabinets painted, new countertops, backsplash and flooring. And you will love the first floor laundry/mud area just inside the back door. There are two bedrooms up. You can have your master on the first floor or 2nd, both great size bedrooms. Updates include new house roof 2020, newer windows, electrical updates, flooring, paint and fixtures throughout, lots of drywall replacement, additional grouting to the concrete area around the base of the home. The concrete floor in the garage was replaced, garage painted, the waterline from the street to the house was replaced and so much more. The work is done here, get ready to move in and enjoy this home and this community for the summer.", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "4527 State Route 43", "year_built": 1928, "bed": 4, "bath": 2, "ptype": "Multi-family", "price": 129900, "sqft": 2484, "desc": "Property is on 1.268 acres of land. Great rental with some TLC. One unit has bedroom on 1st floor with dining room and living room, dorm style bedroom also available in this unit. 2 car garage in center. 2nd unit has living room, kitchen and 2 bedrooms with 1 full bath. Sellers are motivated.", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "1165 Meadowview Rd", "year_built": 1962, "bed": 3, "bath": 2, "ptype": "Single Family Home", "price": 150000, "sqft": 1732, "desc": "This unique home is on a corner lot and is spotless clean and move-in ready!  The home has a new roof from 2015 and the kitchen was remodeled in 2012.  Additional living space in the lower level and plenty of storage as well.  There is an attached, 4-car garage - perfect for the handyman with lower level access from the garage as well.  It is a great location near Black Fork Lake, several nearby golf courses and parks (including Mogadore Reservoir Park) and quick access to Kent State  and I-76.  A rural setting with retail amenities nearby...There is an optional association fee for use of community Lake (Brimfield Lake) of $100 annually.", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "955 Edgewater Cir", "year_built": 2004, "bed": 5, "bath": 3, "ptype": "Condominium Unit", "price": 299900, "sqft": 1448, "desc": "*Beautiful waterfront condo in The Lakes at Franklin Mills!* Enjoy the amazing view this condo offers from the large deck and the gorgeous sun room! Walk in the front door to high ceilings, hardwood floors and an open concept floor plan. Just off the foyer is a nice sized bedroom with hardwood floors and an updated full bathroom. The bathroom offers a quartz top vanity and ceramic tile flooring. The eat-in kitchen features beautiful quartz countertops, grey cabinets and new black stainless steel appliances. The great room has nice white built-in cabinets, a gas fireplace, and large windows providing a relaxing view. Just off the dining area is the sun room, which is the perfect place to enjoy your morning coffee! The master suite has vaulted ceilings, hardwood floors, and a large walk-in closet. The master bathroom has ceramic tile, a large garden tub and double vanity. Down to the lower level you will find a large finished area with access to the deck. The lower level features brand new carpet throughout, 3 additional bedrooms, an updated full bathroom, a large bar, and a huge recreation area. Each bedroom is a nice sized room with lots of natural light. The updated full bathroom has vinyl plank flooring and a quartz top vanity. There is also plenty of space for storage in the unfinished area. This condo has it all and won't last long! \nUpdates: Fridge, stove, microwave-2018 a/c-2017 updated kitchen-2016 Carpet-2020 *Brand new dishwasher coming*", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "1030 Leonard Blvd", "year_built": 1941, "bed": 3, "bath": 1, "ptype": "Single Family Home", "price": 169900, "sqft": 0, "desc": "WOW! Move right in to this completely redone Cape!  The new kitchen boasts granite counter tops, white cabinets and stainless steel appliances, it opens to the great room which has vaulted ceilings, two new skylights and a large sliding door that leads out to a private deck, large usable backyard and storage shed.  The main bathroom has been redone with new flooring, tiled shower and vanity.  The hardwood floors have just recently been refinished though out the home.  Upstairs is a huge master bedroom! The best part is EVERYTHING has been done- New roof, furnace, AC, water tank, windows, electric box, lighting, gutters, driveway, front walkway etc. etc. Schedule to see this one FAST!", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "Meloy Rd", "year_built": 0, "bed": 0, "bath": 0, "ptype": "Raw Land", "price": 190000, "sqft": 0, "desc": "Welcome to your private oasis! This gorgeous property offers frontage on Meloy and Powdermill- potential to parcel off an additional building lot in the future. The property features a beautiful pond, pavilion, inground pool and outbuilding. This is truly a one of a kind property. Adding your dream home on this land is a once in a lifetime experience. ***THE HOUSE IS A SEPARATE LISTING***", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "902 Fieldstone Dr", "year_built": 1996, "bed": 3, "bath": 4, "ptype": "Single Family Home", "price": 239900, "sqft": 1675, "desc": "A Gardener's Dream in sought after Fieldstone Development echoes perennials & entertaining areas for days! With over 70 perennials, 100 strawberry, 50 blueberry & 40 raspberry bushes - all organic, you'll be sure to enjoy the fruits of this home owner's labor. A bright kitchen with all new (2019) appliances & large eating area. Family rm w/vaulted ceiling & brick fireplace. Kitchen overlooks a charming deck with great space for those summer cookouts. Backyard boasts privacy along with a unique hill of flowering plants, over-sized shed, patio along w/a fire pit for those yearlong s'mores & gatherings. Ext paint 2012. Roof 2016. H2O new 2020. Home warranty. Master features vaulted ceiling, walk-in closet & bath w/skylight. Liv and din room areas add to the home's charm. Convenient 1st flr laundry steps thru to attached two car garage. You'll be wowed upon entering the professionally fin lower level, a large bar of maple cabinetry, extra lighting, glass doors, unique shelving, and surround sound. A beautiful, designated office/craft room w/white cabinetry & spacious counter. Just exiting your rec room, there is an unfinished storage area, currently used as a home gym. With a walk out bsmt, this home offers an addtl. perfect little nest for your relaxing morning coffee. Extra storage w/stair access to attic. The backyard is also near park & baseball fields. Check out this live video https://youtu.be/_wZBhA97fzo", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "224 South Prospect St", "year_built": 1910, "bed": 3, "bath": 2, "ptype": "Multi-family", "price": 146900, "sqft": 1644, "desc": "Charming 2 unit home with 2 bed/1 bath in lower level and 1bed/1bath in upper level is conveniently located close to KSU, downtown, shopping, and restaurants.  The lower level offers 2 bedrooms, 1bath, living area, dining area and mud rm with storage.  The kitchen has refrig, stove and dishwasher, gar disposal and access to basement with washer and dryer. The lower level also has access to 2 car garage w/ opener.  The upper level offers eat-in kitchen with refig and stove, living area. spacious bath, bedroom and mud room and access to carport. Both units have window air conditioners and NEW Metal Roof was installed in 2019.", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "Jameson", "year_built": 1960, "bed": 3, "bath": 1, "ptype": "Single Family Home", "price": 75351, "sqft": 1170, "desc": "This property is Real Estate Owned, or REO. The property was foreclosed and repossessed by a lender when the owner failed to make payments. A bank is now the owner. Since banks are not in business to own homes, they are usually interested in selling foreclosed homes quickly at attractive low prices. A list price is published but reasonable offers can be submitted for consideration. Offers can be submitted through the official Listing Agent but in some cases, no agent is listed and offers can be submitted the bank owner directly.", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "5185 Sunnybrook Rd", "year_built": 1960, "bed": 3, "bath": 3, "ptype": "Single Family Home", "price": 100000, "sqft": 1848, "desc": "Kent ranch with 3 bedrooms, 3 baths, large living room that opens to dining room and a nice size family room with fireplace and sliders to deck.  Nice size bedrooms.  Master with walk in closet.  Lower level with potential for additional living space and sliders to patio and fireplace.  This home is in need of updates and repairs.  Subject to lender and court approval.  Selling as is.", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "7398 Myrna Blvd", "year_built": 1958, "bed": 3, "bath": 2, "ptype": "Single Family Home", "price": 149900, "sqft": 1288, "desc": "This home in the Twin Lakes community shouts out opportunity!  Bring your personal touch and some handyman skills and this can become your Gem near the lake!  The main level just needs some finishing touches, paint and decorating  skills.  The lower level finish construction has been started.   This area is plumbed for another full bath, if you so desire.  It has wood stud walls laid out, wiring for overhead lighting and electrical installed. So purchase some drywall and a few fixtures and you'll have more usable space, that has its own walk out access.  The yard just needs some sprucing up.  Soon enough, you'll be enjoying the life of Lake community living!", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "7632 West Lake Blvd", "year_built": 1996, "bed": 4, "bath": 5, "ptype": "Single Family Home", "price": 550000, "sqft": 3792, "desc": "Welcoming you thru this towering 8’ front door in to the 2-story foyer, quickly you’ll see “Custom” abounds! An open and flowing floor\nplan provides opportunities for family closeness and “social” distancing. In the great room, there's a FP,  and transom windows\noverlooking the channel leading to West Lake of Twin Lakes. The gourmet kitchen displays a wall of windows and slider to the patio area, which is just above the channel.  Epic work spaces and custom cherry cabinetry provide you with many culinary specifics. The LR with its wall of bookshelves and windows, recessed lighting, and crown molding will be a quiet respite.\nHead up the steps to a private guest suite that is completely self-contained, bright and open. Back to the main level, the formal\ndining room with tray ceiling, transom windows, and corner cabinetry will be the ideal place for large family dinners. The LL space\nhas a family room, windows for natural light, game room, home school area, large laundry room w/ loads of storage and counter\nspace, full bath and a complete kitchen with secluded pantry storage! Head upstairs-first stop is the owner’s suite, home to a huge\noffice with so much functional space, glamour bath w/ double sink, garden tub, enormous closet w/ built-ins, and bedroom area w/ vaulted ceiling. Two other bedrooms and a full bath! Much thought and love were put into the design and construction of this home. Lake privileges to both East and West Twin Lakes amenities-lake fun all year!", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "V/L State Route 59", "year_built": 0, "bed": 0, "bath": 0, "ptype": "Raw Land", "price": 895000, "sqft": 0, "desc": "Approx 25 acres in Franklin Township Subject to lot split approval", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "1667 Honeychuck Ln", "year_built": 0, "bed": 0, "bath": 0, "ptype": "Raw Land", "price": 70000, "sqft": 0, "desc": "Last home site in Country View Estates. Beautiful rolling lanes of upscale custom homes set in a neighborhood boasting\nan \"Open Space\" concept that sustains the \"Large Country Feeling\" throughout. This home site is nestled in a cul-de-sac of\nthe final phase of Country View Estates. A wooded backdrop offers the rear yard privacy that you have been looking for.\nLooking for a neighborhood with low traffic past your home? Here it is.\nCall for deed restrictions and other documentation.", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "1495 River Edge Dr", "year_built": 1993, "bed": 4, "bath": 4, "ptype": "Single Family Home", "price": 359900, "sqft": 2758, "desc": "Welcome home to this custom-quality built home located in highly sought after River Bend neighborhood. Attention to detail is evident from the moment you step into the gracious two-story foyer. Flanking the  foyer you will find a formal Dining Room and the expansive Living Room with French doors that flows into the Family Room. This room will become your favorite gathering spot with a uniquely designed brick fireplace with a raised hearth, mantel and built-in side bookcases. The spacious remodeled kitchen is a chef's dream with the huge middle island, granite countertops, SS appliances and maple cabinetry. There is also a large dinette area that easily accommodates casual dining. French doors off the FR leads to the light-filled, heated Sun Room with a cathedral ceiling offering a picturesque view of the old Oak Knolls golf course. A main floor laundry room and half bath round out the first floor. The inviting master suite features a walk-in closet and glamour bath with whirlpool tub & skylight. Three additional BR's and bath complete the second floor. The lower level has been professionally finished into a rec room and a full bath. Special features include extensive crown moldings , HW floors, 9 ft. ceilings and sprinkler system. This development has much to offer : close proximity to schools, river park access w/kayak launching and fishing, walking distance to community pool and tennis courts, easy access to hop on the Hike & Bike Trail, street lights and sidewalks.", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "500 Fairchild Ave.", "year_built": 1901, "bed": 3, "bath": 1, "ptype": "Single Family Home", "price": 74800, "sqft": 1382, "desc": "Three bedroom Colonial located near downtown Kent. Minutes from Kent State University. Zoned Single family. Call today.", "nbhd": "Downtown Kent"},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "4598 Sherman Rd", "year_built": 1960, "bed": 4, "bath": 3, "ptype": "Single Family Home", "price": 225000, "sqft": 2496, "desc": "This charming home in Kent boasts a country-like setting! Walk into the large foyer that leads to an open living area with new gray laminate flooring, fireplace and a large picture window bringing in so much natural light. Down the hall you will find a first floor master bedroom with ensuite bathroom. Another full completely updated bathroom with cast iron bathtub is right across the hall and an additional office bedroom. The large open kitchen and dining area offers granite countertops, a generously sized island, beautiful backsplash, a new dishwasher and plenty of cabinetry. There is a slider off of the dining area leading to the deck and completely fenced-in backyard with wooded views! You will see two stone patio areas and views of the pond just behind the house. With fresh landscaping, flowers and many trees this back yard feels like an oasis. The laundry room is also located on the first floor and has brand new laminate flooring. Upstairs you will find the rest of the generously sized bedrooms all with new laminate flooring and fresh paint. The full bath on the second floor has also been completely updated. The walkout basement has a brand new high efficiency boiler installed in 2019 and full sized windows to create an additional space to your liking. Close to KSU, downtown Kent, highway access, Brimfield park, dog park, bike trails and more!", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "Jameson", "year_built": 1960, "bed": 3, "bath": 1, "ptype": "Single Family Home", "price": 75351, "sqft": 1170, "desc": "This property is Real Estate Owned, or REO. The property was foreclosed and repossessed by a lender when the owner failed to make payments. A bank is now the owner. Since banks are not in business to own homes, they are usually interested in selling foreclosed homes quickly at attractive low prices. A list price is published but reasonable offers can be submitted for consideration. Offers can be submitted through the official Listing Agent but in some cases, no agent is listed and offers can be submitted the bank owner directly.", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "1118 Lake Martin Dr", "year_built": 1990, "bed": 4, "bath": 4, "ptype": "Single Family Home", "price": 399000, "sqft": 4280, "desc": "Custom built, elegant, & contemporary - you will be proud to call it home!  Designed with an open concept floor plan, this stylish home has many upgrades and is move in ready. The 2-story open foyer leads to a beautiful great room accented by a cathedral ceiling with 6 skylights & a wall of windows providing for an abundance of natural light. The marble double sided gas fireplace, separating the great room and the dining area, creates the perfect ambiance.  The built-in granite bar is perfect for gatherings! The large welcoming kitchen features custom cabinets, granite counters, desk space, and stainless steel appliances.  Enter the master suite through french doors to find double closets, a spacious en’suite bath with double vanity and a walk-in shower.  Enjoy your favorite beverage on your private deck from your master suite or great room overlooking a landscaped backyard.  Another bedroom, full bath, powder room, laundry rm and lots of closet space completes the first floor.  The lower level provides much flexibility and features smart space that can be used to meet your needs including rec room, bonus rm, 2 bedrooms, office, full bath, 2 doors to deck, & plenty of storage space.  Enjoy your backyard deck for grilling and relaxation.  A circular driveway w/ covered front entrance, 3+ car garage w/ extra high ceiling add to the appeal and functionality of this home.  This property offers Lake Martin Privileges-no fee.  Recent updates? To much to list—please see supplement.", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "5327 Fawn Cir", "year_built": 2003, "bed": 3, "bath": 3, "ptype": "Condominium Unit", "price": 152900, "sqft": 1490, "desc": "Move right into this remodeled free standing condo! Gorgeous new “2019” quartz counter tops, new undermount sink and faucet, stainless steel appliances and pantry.\nSliding glass door in the kitchen provides easy access to the concrete private patio. Living room features corner cozy fireplace! Three bedrooms upstairs. Owners suite features full\nbath and walk in closet. Dramatic two story foyer with beautiful lighting and white trim.\nDo yourself a favor and put this on your list to view!", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "729 Berkeley St", "year_built": 1954, "bed": 4, "bath": 2, "ptype": "Single Family Home", "price": 144900, "sqft": 1326, "desc": "This cute as a button 4 bedroom, 2 full bath cape cod is situated just one house away from the quiet dead-end. Conveniently located only a stone's throw from Kent State, downtown Kent, restaurants, shopping, recreation center, parks, and major highways. The first floor living space boasts original hardwood floors, an eat-in-kitchen, a cozy sunroom overlooking the fully fenced flat backyard and large shed, a full bath, and 2 bedrooms. 2 more generous bedrooms and another full bath round out the upstairs. Plentiful storage is provided throughout with ample closet space, original built-ins, and a large walk-out basement. Lovingly maintained and only on its second owner, there is nothing to do but move right in! Seller has provided a one year Home Warranty for buyers piece of mind. Come see before it's gone!", "nbhd": null},
{"city": "KENT", "state": "OH", "zipcode": "44240", "address": "526 SANDY LAKE ROAD", "year_built": 1995, "bed": 2, "bath": 3, "ptype": "Other", "price": 299000, "sqft": 0, "desc": "Welcome Home to 526 Sandy Lake Road.  This charismatic 2 bedroom, 3 full bath country conventional situated on nearly 2.5 scenic acres, is nestled in the southeast corner of Brimfield Township, with convenient access to Route 43, Route 44, I-76, & I-77, making for a shortened commute to downtown Akron or ample avenues to Akron Fulton International Airport, Kent State University, numerous parks/lakes, and all the amenities this rural locality has to offer!  This extraordinary rustic retreat boasts nearly 2,300 finished sq. ft. between all three levels, and comes complete with gorgeous cedar wood ceiling throughout, an insulated 2,000 square foot/6-car attached outbuilding (heated/air conditioned), manicured landscaping, multiple chainlink fully-fenced areas, 15 x 15 enclosed hot tub room (hot tub 2016), 38 x 25 pool room w/30 x 16 in-ground pool (newer roof, pool cover, & freshly sanded/stained interior), brick paver walkway/patio w/fire pit, multiple concrete patio areas (one is covered), and a massive wraparound deck perfect for taking in the amazing 180 degree views/scenery.  The main level features an abundance of natural light, a garage conversion ready to be finished, full bath, bedroom, and vaulted great room w/fireplace open to the eat-in kitchen.  The upper level offers a lofted master suite overlooking the great room. The finished lower level features a rec room, area for a second kitchen, laundry room, full bath, and area for housing mechanicals (HWT 2018).", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "473 Spaulding Dr", "year_built": 1970, "bed": 4, "bath": 2, "ptype": "Single Family Home", "price": 150000, "sqft": 1488, "desc": "473 Spaulding Drive is a 4 bedroom 1.5 bath well cared-for colonial home tucked away in a west Kent, Ohio neighborhood close to\nshopping and restaurants (which will be SO appreciated in the near future!). The sun room patio enclosure-type addition adds 3 season\nspace to enjoy the beautiful backyard not included in the finished square footage. With a living room, family room and a dining room,\nthere is main level space for everyone. Windows were replaced in 2015 and stylish pleated blinds installed. The basement, although not\nfully finished has some finished hang-out space, glass block windows, a high efficiency furnace, washer and dryer which convey, and an\nupdated electric panel. This is a beauty and a great opportunity. Schedule your showing soon!", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "5420 Powdermill Rd", "year_built": 2001, "bed": 3, "bath": 2, "ptype": "Single Family Home", "price": 219900, "sqft": 1930, "desc": "This contemporary ranch offers cathedral ceilings and beautiful cherry hardwood floors! A Master Retreat with a full private bath and a nice sized sitting room. Formal Dining, eat-in kitchen, laundry room, and two other nice sized bedrooms finish the first floor. Newer refrigerator, oven, dishwasher, washer, and dryer. A large finished recreation room with a wet bar in the basement is perfect for entertaining. There is also a newly finished bedroom in the basement. The yard is completely fenced in with a large deck. Close to Kent State University, shopping, and expressways.", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "7568 Diagonal Rd", "year_built": 1958, "bed": 4, "bath": 3, "ptype": "Single Family Home", "price": 189900, "sqft": 2376, "desc": "THIS IS IT!  Nearly 2 ACRES in Twin Lakes just minutes to Downtown Kent, Ohio, KSU, shopping, and restaurants! This spacious split-level sits on 1.78 sprawling wooded acres and includes a second waterfront parcel (.03 acres) that provides full lake privileges (swimming, boating, fishing, and a private beach) - the BEST of both worlds! The home includes 4 Beds and 2.5 baths, a wood-burning fireplace, sunroom, and has plentiful windows to enjoy the secluded views. Upstairs is a huge master suite with a large sitting area and en-suite bath, a second full bathroom, and 2 additional bedrooms. The lower level boasts a large recreation room with built-in cabinets, a half bath, a 4th bedroom, laundry, and a 2-car garage. While the home is in need of TLC, recent updates include newer fridge, dishwasher and wall oven (~3-5 years), water pump (~4 years), HVAC and roof (2003), windows (~15 years), and newer drainage pipe for garage (2020). Vacation where you live - don't let this fabulous opportunity to own your private oasis by the lake pass you by!  Home is being sold AS-IS.", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "4087 Chapman Dr", "year_built": 2002, "bed": 3, "bath": 3, "ptype": "Single Family Home", "price": 244900, "sqft": 1627, "desc": "Welcome to 4087 Chapman Dr in lovely Brimfield! This stunning Colonial in the Chapman Farms Subdivision features 3 bedrooms, 2.5 baths with 1st floor laundry and a 2 car attached garage with opener, situated on a nicely sized level lot.  Entering the home you will notice the gleaming laminate wood flooring, a formal living room and dining room, plus an open concept eat-in kitchen and family room with access to both the patio and screened in porch.  A half bath and conveniently located laundry room complete the first level.  Make your way upstairs and you will find the generously sized master bedroom with vaulted ceilings, en suite bath, as well as two additional bedrooms and another full bath. Plantation Style blinds throughout the home.  The full basement is perfect for storage or could easily be finished for an additional living space.  This home has it all! Tons of updates include new roof 6/1/2020, New 90+ furnace & A/C 6/6/2020, composite deck 2019, gutter guards 2019, water heater 2019, sump pump 2019, gas logs 2017, granite/wood countertops with under mount sink 2018, lower patio 2019, stainless appliances 2018, Pergo Floors 2005, Security system, Carrier UV light.  Schedule your private showing today!", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "4776 Perie Wood Ln", "year_built": 2013, "bed": 3, "bath": 4, "ptype": "Single Family Home", "price": 485000, "sqft": 3210, "desc": "Enjoy this fabulous home with many ammenites. large spacious living room with 24 ft. coffered ceilings, a 2 story fireplace with\nsurround sound it Opens to a stunning kitchen with high end cabinets to the ceiling and soft close drawers and doors Large panty a\nbeautiful island. large spacious dining room all with hand scraped wood floors. spacious first floor master featuring a large master bath\nglass and tile shower. Large walk in closet plenty of room for all of your clothes. Kitchen walks out to a beautiful deck that overlooks a\npark like setting. It is like having a vacation every day with the 16,000 gallon salt water gunite pool with a tanning ledge and fountains. 6ft/3ftD\nsoftware is available for lights, heat ect. that you control it from you phone. pool is 3 years old, plenty of room to sit around the gas firepit\nfor the cool evenings. There is also a hard cover gazebo. for rainy days.\nThe second floor features 2 spacious bedrooms , a loft area  \n The lower walk out level  features a bar area with a tv and a modern fireplace on the wall. Plenty of space to host a large\nparty of family and friends. The poker room is also a great place to enjoy or make it into an area for a pool table. Just around the corner is\na media room , surround sound speakers will stay that are attached to the wall.\nThe oversized 3 car garage which they actually had a 4th car in it at one time walks into the mud room, there are stairs to the\nlower level . walk through with the 3D tour.", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "4925 Brower Tree Ln", "year_built": 0, "bed": 0, "bath": 0, "ptype": "Raw Land", "price": 49900, "sqft": 0, "desc": "Level lot #7 in Sugar Maple Hills development in area of fine homes. Choose your own builder. Recreation is the playground & walking trail.", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "371 Eckwood Dr", "year_built": 1962, "bed": 3, "bath": 2, "ptype": "Single Family Home", "price": 114900, "sqft": 1008, "desc": "This 3 bedroom, 1.5 bath brick ranch sits on a dead-end street on a wooded half-acre lot. This is the perfect opportunity for anyone looking to invest in a fixer-upper! The handicap-accessible ramp leads you to the front entrance. Natural light pours into the living room from the large picture window. Many cabinets in the kitchen along with appliances that stay plus a half bath sits just off of the kitchen. Down the hall, you will find all three bedrooms and a full bathroom. Located just off of Mogadore Rd with easy access to highways and more. Schedule your showing today!", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "1316 Aarons Way", "year_built": 1978, "bed": 3, "bath": 2, "ptype": "Townhouse/Townhome", "price": 75000, "sqft": 1365, "desc": "Great place to start or would make excellent rental property.  Three bedrooms, 1 1/2 baths, full basement, fireplace, garage, deck and walk out basement. Close to expressway and be in Akron or Cleveland within minutes.", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "1408 Loop Rd", "year_built": 1984, "bed": 3, "bath": 3, "ptype": "Condominium Unit", "price": 123900, "sqft": 1508, "desc": "Don't rent when you can buy! Just minutes from Kent State University and the Kent State Rec Center. Open floor plan with sliding door to an over sized private patio. The kitchen is large, plenty of cabinets and overlooks dining area. Upstairs is a large master bedroom with dual closets and it's own full bathroom. Two other bedrooms and another full bath complete the second floor. Oh, I forgot to mention ---conveniently located second floor laundry too! Two car attached garage! Association swimming pool is close to condo, which is great in the summer! Freshly painted throughout with brand new carpet on the second floor. Nothing to do but move in and enjoy!!", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "3916 State Route 43", "year_built": 2017, "bed": 3, "bath": 2, "ptype": "Single Family Home", "price": 259900, "sqft": 1760, "desc": "Looking for move in ready first floor living, convenient location yet peaceful and expansive outdoor space? Well look no further! This beautiful property is 3 years young, and was built with low-maintenance in mind. Leaf gutter protection means no spring clean out, and the bonus feature of a Generac whole house generator provides peace of mind in case of power outages. The property is completely handicap accessible, starting with ground-level front entry, a ramp in the garage, and wide doorways to all rooms.  The open concept living space in the center of the home includes a spacious kitchen that will make most home chefs ecstatic! There is a large center island opposite the high-end Heartland range that makes food prep a breeze. In the master bedroom, two large closets provide ample room for clothing & the master bath is separated by an attractive barn door. A zero entry shower in the master bath adds to the accessibility factor.  Two additional bedrooms can be found on the opposite side of the home, along with the second bathroom.  Walk through the french doors from the eat-in kitchen & you will find a peaceful, covered patio with open space and trees to provide that much needed tranquility.   \nDid I mention convenient location?  In less than 1 mile, you can be on I76 and 2.5 miles gets you to the Cascades of Brimfield with ample shopping & restaurants There's no such thing as a perfect property, but this one is pretty close! Don't wait; schedule your showing today!", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "571 Perry St", "year_built": 1925, "bed": 4, "bath": 1, "ptype": "Single Family Home", "price": 94500, "sqft": 1385, "desc": "Welcome home to this spacious Colonial tucked away near the end a quiet, cul-de-sac street! So much bigger than it looks from the curb! Enjoy a large and newly updated kitchen with loads of cabinet and counter space. Fresh modern paint colors. Newer flooring throughout. Totally remodeled bathroom with a walk in shower. Continue towards the back of the home and find a great dining room and/or flex space, complete with a screened in sunroom out to the quiet back yard. Enjoy 2 first floor bedrooms as well as 2 second floor bedrooms! Huge walk in attic space adds tons of storage. 1+ car attached garage and a great size shed. Fresh paint and brand new carpet throughout!  Convenient access to all Kent has to offer! This well cared for home is an absolute Must See!", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "1327 Cedarwood Dr", "year_built": 1979, "bed": 3, "bath": 2, "ptype": "Townhouse/Townhome", "price": 85000, "sqft": 1239, "desc": "Welcome home to 1327 Cedarwood Drive, Brimfield Twp, Ohio. Why rent when you can own? Step into this updated townhouse condo in Sandlewood. Updated oak kitchen including refrigerator, oven/range and dishwasher. Large L-shaped living/dining room with wood burning fireplace and patio doors leading to exterior balcony. 1/2 bath on main floor. The upper level has 3 nice size bedrooms with updated full bath. Lower level has laundry with full hookup and utilities. One car attached garage with extra storage space and garage door opener. Updated paint and neutral palette. Conveniently located to shopping, I-76 and colleges.", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "4545 State Route 43", "year_built": 1961, "bed": 2, "bath": 1, "ptype": "Single Family Home", "price": 90000, "sqft": 1200, "desc": "Tons of potential in this 2 bedroom home on a double parcel lot totaling .88 acres! Dual zoned residential and commercial. Near businesses, schools and downtown! Could keep as a residential home or use commercial lot for your business! Sold As Is. Schedule a private showing today!", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "State Route 43", "year_built": 0, "bed": 0, "bath": 0, "ptype": "Raw Land", "price": 42900, "sqft": 0, "desc": "Almost 3 acres on the North side of the East Twin Lake! Tuck your new home back from the main road for plenty of privacy.\nPossible membership available to Twin Lakes Association, allowing access to both of the lakes as well as the amenities of both!\nVacation living year 'round!", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "728 Allerton St", "year_built": 1954, "bed": 3, "bath": 2, "ptype": "Single Family Home", "price": 142000, "sqft": 0, "desc": "Lots of potential here! Great neighborhood, newly remodeled baths. 1st floor bedroom, enclosed patio/sun room. Needs some tlc. Private wooded backyard with large deck. Selling AS IS. 1 1/2 car garage.", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "508 Roosevelt St", "year_built": 1950, "bed": 4, "bath": 3, "ptype": "Single Family Home", "price": 184900, "sqft": 1392, "desc": "Brick Cape Cod  4 Bedrooms  2 1/2 Baths  2 Car Garage  Beautiful landscaping surrounds the house with beautiful secluded Patio in Backyard to enjoy those quiet moments when you want to relax, read a book or visit with friends   Backyard is fenced in for privacy   This home features a 1st floor Bedroom and a very cozy office if you have to work at home   Hardwood floors in the Dining Room, Living Room, Office and 1st floor Bedroom    Front Foyer is tiled and ready for visitors  Upstairs has 3 Bedrooms and a 1/2 Bath with lots of storage  Basement is partially finished with a cozy bar & sink and features new laminate flooring   Get warm by the Pellet Stove which is fueled by pellets   A storage pantry is also a nice feature   Roof on both Garage and House was done in April 2006   New furnace April 2007  Pellet Stove was added in December 2008   Come and look at this beauty, it won't last long!", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "110 Judson Rd", "year_built": 1974, "bed": 3, "bath": 2, "ptype": "Single Family Home", "price": 209900, "sqft": 1144, "desc": "Completely remodeled! This immaculate ranch offers a spacious fenced in back yard & all of the finishes you could hope for plus Stow Schools or open enroll to Kent. Brand new septic system in 2019 too! Enter a welcoming living room w comfy carpet and wonderful daylight that flows over to the eating area w gorgeous hardwood floors. The remodeled kitchen includes raised panel cabinets, tile backsplash and stainless Kitchen Aid convection oven, microwave, dishwasher and French door refrigerator- plus the continuation of the refinished hardwood floors. Bedrooms all include closets w double rod/shelves. Upgraded full bath w custom tile shower w tub, lg vanity w drawers & granite counter plus tile flooring. Incredible finished basement complete w recessed lighting, glass block windows, giant rec room w carpeting plus areas w beautiful wood-look tile. Full bath includes vanity w drawers & granite counter plus a shower. Lovely finished laundry rm w fold-down ironing board, utility sink & storage area. Fenced back yard w no-climb wire, 220 outlet for hot tub, patio, fire pit and wonderful landscaping & privacy. Everything down to the studs in 2012- Doors, Trim, Drywall, fixtures, paint (in & ext), well pump/pressure tank, A/C, Kitchen, Bath, Refinish Hardwood, Insulation in attic, Exterior Doors, Concrete drive/turnaround/walkway/garage floor & steps. ’13 Windows. ’15 Sump pumps. ’16 Finished basement, Elec Panel. ’17 Appliances. ’19 Septic, Backsplash. ’20 Softener.", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "1617 Morris Rd", "year_built": 1967, "bed": 4, "bath": 3, "ptype": "Single Family Home", "price": 220000, "sqft": 2266, "desc": "This turn-key Kent, Ohio 4 Bed, 3 Bath huge bi-level is perfectly situated adjacent to Highland Park, effectively expanding the back yard (through picket gate) without the added lawn work! Granite kitchen, with wonderful glass/ceramic backsplash, generous 4-seater bar, has been ingeniously opened up, creating spacious kitchen/living/dining area! All 3 FULL baths have been given facelifts! Original hardwood throughout main level except kitchen. Newer low-maintenance composite deck is IMMENSE & turns entertaining into a cinch! Also from the deck, a view of nature that's peaceful and quieting. Full vinyl picket for fur babies or young ones. On-trend paint throughout! Family room w/ wood burning fireplace makes for a nice winter evening. Comfortable walk to Kent State University! Far enough from downtown to avoid the bustle, but close enough to walk to South side shopping or bike or walk to downtown. Routes 43, 261 and I-76 are all minutes away as are bike trails! Washer/Dryer included here! All of this and a 1-year warranty provided by the sellers for buyer peace of mind!", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "887 Highridge Ln", "year_built": 2008, "bed": 4, "bath": 3, "ptype": "Single Family Home", "price": 259000, "sqft": 2354, "desc": "You cant miss this well maintained colonial in the beautiful Lakes of Franklin Mill. You will enjoy a large eat in kitchen with a cozy morning room that allows a gorgeous view. There is plenty of room upstairs with 4 spacious bedrooms. You get the convenience of having a perfectly located second floor laundry room. The finished walkout basement is a must see. You will feel right at home in this lovely neighborhood with near by parks and a private neighborhood walk path. Don't hesitate to make your appointment today!", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "836 Ravenna Rd", "year_built": 1967, "bed": 5, "bath": 4, "ptype": "Single Family Home", "price": 254000, "sqft": 3558, "desc": null, "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "5885 Thorndale Dr", "year_built": 2003, "bed": 5, "bath": 4, "ptype": "Single Family Home", "price": 349900, "sqft": 3628, "desc": "Welcome home to 5885 Thorndale Dr. located in the desirable community of Willow Ridge, Kent Ohio. Tucked away in Franklin Township, this custom-built home has so much to offer. As you walk to the front door you are greeted by the warm and inviting front porch where you can enjoy your morning coffee, or an evening conversation. The kitchen is the perfect place for entertaining with it’s large center island, beautiful solid cherry cabinets and open dining area where you can also walk out to the  patio with a custom built pergola and the quiet wooded back yard. Off the kitchen is the study with glass panel doors and a closet perfect for a home office or den.  The living room could be a separate quiet spot or open up the pocket doors to the family room with tons of natural light with its wall of windows.  The 3 car garage could easily be 4 in tandem and has its own staircase to the basement and door out to the backyard. The mudroom/drop zone also has a door to the back yard and plenty of hooks and closet space along with a 1/2 bath.  Upstairs features 5 bedrooms, Master suite 2nd floor laundry, 3 full baths and plenty of storage.  The 5th bedroom could easily be a large recreation space too. The basement which has poured wall foundation and high ceilings, has tons of possibilities and comes plumbed for a full bath.  All this and close to the university, downtown, hike and bike trail as well as Chase Park.  Ask for a list of highlights as there are far too many to list!", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "1246 Hudson Rd", "year_built": 1930, "bed": 4, "bath": 1, "ptype": "Single Family Home", "price": 119400, "sqft": 1229, "desc": "Welcome to 1246 Hudson Rd on over one acre!  This charming home has 4 bedrooms two of which are conveniently located on the first floor.  Freshly paint throughout and carpets have all been professionally cleaned.  Updated bathroom! Over sized 2 car garage and storage shed.   Call today to schedule your private tour!", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "3899 Lor Ron St", "year_built": 1963, "bed": 3, "bath": 2, "ptype": "Single Family Home", "price": 155000, "sqft": 1092, "desc": "Solid ranch home in Brimfield Lake Allotment.   Over 1/2 acre with dozens of perennials in gardened areas.  Back deck with built-in benches  for view to woods and quiet sunset evenings.  Deck is 14' by 16 '.  Mature trees  for shade and bird -watching.  Home has oak flooring under most carpeted areas. High efficiency furnace and central air installed in May of 2020.  Basement adds more living  space with a large half bath that could readily have tub/shower added.  Office, rec room and bar area  could have updating to refresh this great lower-level living space.  A walk down the street takes you to Brimfield Lake and Park with covered picnic pavilion and swings for the children. This is an appealing home and area.  Much to appreciate here!  Just add your own finishing touches.  Close to Cascades Shopping area, local schools, community government center  and I-76.", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "7472 Ferguson Road", "year_built": 1995, "bed": 4, "bath": 6, "ptype": "Single Family Home", "price": 990000, "sqft": 6204, "desc": "A park like setting is just one of the things that makes this a spectacular house. Over 10 acres which includes a pond, picnic area, and patio make it perfect for entertaining either formal or family. Elegant and friendly foyer with a formal living room and dining room. Wide open staircase to the second floor, Large open kitchen with Corian countertop's and harvest table with granite countertop set off the custom built Schrock cabinets of Walnut Creek, newer appliances and custom made window blinds. Large family room with fireplace and fresh very desirable wall paint and custom made draperies. Sunken hearth room and a sun room over looking the pond's water fountain. First floor has a laundry room and a mud room room off the attached 4 car garage. Wet bar and office are both perfect for the work at home professional. Four large bedrooms with a master bath and huge closets. One guest bath and one Jack and Jill. Finished recreation room in the lower level perfect for the exercise equipment and home theater.", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "Powdermill Rd", "year_built": 0, "bed": 0, "bath": 0, "ptype": "Raw Land", "price": 70000, "sqft": 0, "desc": "GREAT opportunity to own your private piece of paradise in Brimfield Township! This 4.62 acre lot features a long drive that opens up to beautiful pond views.  Natural gas and public water available at the street. Call today to schedule a walk through!", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "523 Dansel St", "year_built": 1960, "bed": 3, "bath": 2, "ptype": "Single Family Home", "price": 168500, "sqft": 1500, "desc": "Beautifully maintained 3 level split on a sweet quiet street.  Large open kitchen with new oven and separate outdoor access.  Beautiful wood floors in all the spacious bedrooms as well as updated full and half baths.  You will love the extra large rec room with fireplace and large storage area.  To finish this gem off, the backyard is second to none!  This house is a must see; just move in and enjoy!", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "2368 Meloy Rd", "year_built": 1997, "bed": 4, "bath": 4, "ptype": "Single Family Home", "price": 269900, "sqft": 2242, "desc": "This terrific 4 bedroom, 3 and 1/2 bath home on 1.59 acres has more amenities than I can name. Perfectly landscaped lot with a maintenance free 14 x 20 deck that has top of the line retractable  awing. Gas fireplace in great room has vent less logs and there is hardwood floors under new carpet.  For that country living it has a whole house back up generator and whole house surge protector. Sump pump has back up battery. Reverse Osmosis System.  New roof and home warranty add to your comfort zone. The first floor bedroom, glamour bath, walk in closet and laundry room are great for convenience. This open concept has vaulted ceilings in the great room with skylights and an open stair case.The partially finished basement is set up for any kind of workshop you want. Running water, electric ,storage and a full bath. With over 1480 sq ft. you can finish the rest of the basement how ever you want. The invisible fence extras do not stay. Only the underground lines stay. Call today for your private showing", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "6160 1st Ave", "year_built": 1993, "bed": 3, "bath": 3, "ptype": "Single Family Home", "price": 237500, "sqft": 2012, "desc": "GORGEOUS! Fantastic opportunity in the secluded and picturesque Kent Park, just minutes from KSU and vibrant downtown Kent. This bright and open home was beautifully updated in 2019 from head to toe with low-maintenance luxury vinyl plank (w/warranty), canned lighting, neutral paint, and freshly power-washed exterior!  The fully renovated eat-in kitchen features granite countertops and large island w/room for seating, soft-close shaker cabinets w/brushed nickel hardware, stainless steel appliances, wine fridge, glass backsplash; and overlooks the living area with soaring ceilings, gas fireplace w/updated glass surround, and windows galore that provide an exceptional view of the deck and lush outdoor surroundings. A cozy bedroom and adjacent half bath finish off the main level. Upstairs, is a quaint loft/reading nook and 2 bedrooms, each with its own dedicated en-suite bath!  The master bath has a newer walk-in shower and surround w/glass doors. Downstairs, the spacious unfinished walk-out basement features extra high 14 feet ceilings and is plumbed for another bath, providing endless possibilities for extra living space! Walk out to a covered patio, an attached shed, and the plush backyard. Additional updates and amenities include HVAC (2017), humidifier (2016),  well pump (2016), Radon mitigation system (2015), water conditioner w/UV sterilizer (2013), central vacuum, and 1-year HOME WARRANTY provided by seller to the new owner. Do not wait – come see before it’s gone!", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "1065 Jessie Ave", "year_built": 1955, "bed": 4, "bath": 2, "ptype": "Single Family Home", "price": 174900, "sqft": 1572, "desc": "Fantastic Cape Cod is much larger than it looks! Pride of ownership is obvious when you enter this 4 bedroom, 2 bath home. There are many updates to including windows, quartz counter tops, appliances, back deck, and Furnace/ AC in 2018. The lower level rec room is perfect for entertaining, movie night, or play room for the kids. There is also room for exercise equipment or a crafting. All of this plus a ton of storage! Tired of the headache of where to put book bags, coats, shoes and boots? There is a breezeway connecting the garage to the home; perfect place to collect and organize coming or going from the house. The backyard is huge! Enjoy the newly built back deck over looking the large yard, also perfect for hosting a cookout. Call today for a showing!", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "205 Shaw Dr", "year_built": 2017, "bed": 2, "bath": 2, "ptype": "Condominium Unit", "price": 279899, "sqft": 1852, "desc": "Rare opportunity to live in the highly desirable Crossings of Golden Pond condos! Enjoy maintenance free living in this 2-yr young Canterbury model single-level ranch that offers 2 separate bedroom suites, and a den/office that could be used as a 3rd bedroom. The luxurious and open floor plan features cathedral ceilings in the great room, gourmet kitchen, and sunny veranda. The owners spared no expense with over $30k in stunning upgrades including a gas fireplace, private patio, ceramic flooring in bathrooms, Luxury vinyl plank, optional bank of wall and base cabinets in kitchen, Granite counters and undercabinet lighting, upgraded appliances, brushed nickel fixtures, wood blinds, tinted windows, and electric-to-gas conversion for cooking. Community provides exclusive access to the Clubhouse that offers a heated pool, a 24/7 fitness center, and a beautifully furnished social room complete with full kitchen, billiards, large screen TV, and many hosted social events throughout the year. Conveniently located in Kent with its thriving and vibrant downtown, diverse dining, and shopping. Close proximity to KSU, NeoMed, and major freeways. You won't want to miss this!", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "2006 Carlton Dr.", "year_built": 1970, "bed": 3, "bath": 2, "ptype": "Single Family Home", "price": 239900, "sqft": 1780, "desc": "Spacious split in a great location and large backyard has been impressively updated. New electric, furnace, A/C, flooring, bath and kitchen, siding, gutters, roof and more. What hasn't been done! Call Brian 330-715-2047", "nbhd": "Brady Lake"},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "2367 Lynn Rd", "year_built": 2001, "bed": 3, "bath": 3, "ptype": "Single Family Home", "price": 249900, "sqft": 2024, "desc": "Take Social Distancing to a new level with this spacious Bi-level set privately on 1.63 acres. Home sits off the road majestically embracing the beautiful Brimfield skyline. Massive front yard provides plenty of space to play while a gradually sloping backyard provides lovely views, tons of open space, two sheds and a garden area. Inside, a ceramic tiled entry leads up to a spacious area graced with cathedral ceilings. The carpeted Great Room has a propane fueled fireplace and large picture window with unique transom. Conveniently located dining room has easy access to elevated portion of deck through a newer Pella slider. Recently updated Kitchen sports Kraftmaid Solid Maple Cabinets, Quartz Countertops, and Stainless-Steel Sink, and Faucet. Kitchen and Dining share stylish ceramic tile floor and get plenty of natural light from skylight. Vast Master Suite has trayed ceiling, dual closets, and 2 distinct niches. Master Bath has jacuzzi tub with ceramic tile accents, walk-in shower, dual vanities, and ceramic tile flooring. 2 additional bedrooms are amply sized and have appealing maple trimmed window seats. A nicely designed 2nd full bathroom rounds out main living area. Downstairs, a second family room acts as the man-cave and walks out to lower level deck and backyard. The lower level also includes a handy ½ bath as well as a laundry/utility room. Updates include: Deck Painting (’20), Geothermal Heating/Cooling System and Garage Doors (’19), Carpet, Paint and Kitchen (’17)", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "780 Akron Blvd", "year_built": 1964, "bed": 6, "bath": 4, "ptype": "Multi-family", "price": 139900, "sqft": 2592, "desc": "Very Rare Solid duplex in great condition. One unit is occupied with long term month-to-month section-8 tenant - rented at $850 per month. Each unit has it's own driveway and attached garage. 1/2 Bath is on the first floor and full bath on the second. The bedrooms are well sized. The vacant unit has newer flooring and new flooring in Kitchen and entry way. Both units have separate basements and meters. This is a nice duplex that is close to all the amenities just minutes away. good solid income duplex...Fell out of escrow because buyer got cold FEET", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "1929 Pine Dr", "year_built": 1977, "bed": 3, "bath": 4, "ptype": "Condominium Unit", "price": 265000, "sqft": 2983, "desc": "Serenity awaits you at this spectacular 3,000 sf 3 bedroom, 3.5 bath ranch condo with loft in the Pines 1 condo subdivision in Franklin Township, Kent OH. Here you will find mostly neutral colors, and every bedroom boasting an ensuite full bath. You will fall in love with the soaring vaulted ceiling with rustic cedar beam in the 19 x 30 expansive great room with gas fireplace flanked by well crafted built-in curio cabinets. The first floor spacious master bedroom adjoins a fireplaced office or sitting room through pocket doors and has a walk-in closet. The other bedroom on this level also sports a walk-in closet. Each of the main level living areas of the property have sliders to the outdoors, patios or screened porch making entertainment and enjoyment of the surroundings a breeze. Upstairs find the natural light filled loft bedroom suite with vaulted ceiling and huge windows. Sit on your rustic screened porch and enjoy the view of the association-maintained green space. Amenities are many including Lake Royale privileges for small craft/fishing. One year home warranty paid by the seller for the new owner. Come home to life of ease and enjoyment in this private and serene community conveniently located a few minutes from Kent, Streetsboro, SR480 and I-80", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "6149 Marteney Ave", "year_built": 1979, "bed": 4, "bath": 3, "ptype": "Single Family Home", "price": 285000, "sqft": 1944, "desc": "This stunning, modern rustic home offers the perfect combination of serenity and convenience! Completely remodeled 4 bedroom 2-story just waiting for your personal touches! New flooring, light fixtures, kitchen, bathrooms and fresh paint throughout. Step inside the impressive great room with cathedral ceilings, a skylights and large windows. Your inner chef will delight as you continue into the stunning kitchen with granite counters, stainless steel appliances, new white cabinets, subway tile backsplash and a center island with seating and shiplap accents. The kitchen opens to the family room boasting a brick fireplace set against a shiplap wall. Enjoy meals in the formal dining room with window seating. Updated half bath on the main level. Upstairs, the master suite offers a private balcony, a 12x6 walk-in closet and a private full bath with a floating dual sink vanity and separate toilet/shower room - convenient for getting ready in the morning! There are 2 additional bedrooms and a full bath with tile shower surround, a new vanity and shiplap accents. Finished, walkout lower level with a rec room, pocket door to a bonus room/office, a laundry room and another pocket door to a fourth bedroom. 3-car attached garage, too. Very peaceful, fenced backyard featuring a covered back patio with 2 ceiling fans overlooking wooded views. Incredible find! Don’t miss out!", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "Bowman", "year_built": 1962, "bed": 3, "bath": 2, "ptype": "Single Family Home", "price": 1133, "sqft": 1332, "desc": "This listing is For Sale by Owner. Some owners may offer special financing, like Rent to Own. Even though a homeowner chooses FSBO to save money on real estate fees, those savings can be passed on to the buyer as a lower purchase price. Some FSBO homeowners may also offer flexible financing options, including Owner Financing (a good alternative to a bank loan) or Rent to Own. The Rent to Own option would allow you to rent this home for a period of time with an option to purchase it for a predetermined price after the rental period. This gives you time to build up your credit and accumulate your down payment, all while living in the home of your dreams!", "nbhd": "Downtown Kent"},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "7472 Ferguson Rd", "year_built": 1995, "bed": 4, "bath": 6, "ptype": "Single Family Home", "price": 990000, "sqft": 5204, "desc": "A park like setting is just one of the things that makes this a spectacular house.  Over 10 acres which includes a pond,  picnic area, and patio make it perfect for entertaining either formal or family. Elegant and friendly foyer with a formal living room and dining room.  Wide open staircase to the second floor,   Large open kitchen with Corian countertop's and harvest table with granite countertop set off the custom built Schrock cabinets of Walnut Creek, newer appliances and custom made window blinds.  Large family room with fireplace and fresh very desirable wall paint and custom made draperies.  Sunken hearth room and a sun room over looking the pond's water fountain.  First floor has a laundry room and a mud room room off the attached 4 car garage.  Wet bar and office are both perfect for the work at home professional.  Four large bedrooms with a master bath and huge closets.  One guest bath and one Jack and Jill.  Finished recreation room in the lower level perfect for the exercise equipment and home theater.", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "Stinaff", "year_built": 0, "bed": 0, "bath": 0, "ptype": "Raw Land", "price": 20000, "sqft": 0, "desc": "Great build able lot. Additional lot availiable and adjacent to this. price at $43,000 for both S/L 167 Near KSU and freeways.", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "Stinaff", "year_built": 0, "bed": 0, "bath": 0, "ptype": "Raw Land", "price": 25000, "sqft": 0, "desc": "Buildable lot on nice street in Kent. Near KSU and freeways. Additional lot availiable and adjacent to this. price at $43,000 for both S/L 167", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "3679 Elmhurst Ct", "year_built": 1960, "bed": 3, "bath": 2, "ptype": "Single Family Home", "price": 110000, "sqft": 1111, "desc": "Welcome to this adorable ranch home located in Field Local School District.  This inviting abode offers 3 nicely sized bedrooms and 2 baths.  There is a galley kitchen that comes fully applianced.  There is a spacious fenced in back yard with a fire pit and storage shed.  This home has been well maintained and is awaiting a new owner.  Updates include central air in 2019, furnace in 2012, and roof in 2013.  This would make a perfect starter home.  Don't forget the attached garage.  Stop looking and start packing.  Call to schedule a showing today!!", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "465 DEIDRICK ROAD", "year_built": 1974, "bed": 3, "bath": 2, "ptype": "Single Family Home", "price": 279900, "sqft": 1776, "desc": "UPDATED/OPEN/NEUTRAL 3 BEDROOM HOME COMPLETE WITH 25 X 12 FINISHED LOWER LEVEL, WIDER/DEEPER/INSULATED 2-CAR GARAGE, COVERED MAINTENANCE-FREE FRONT PORCH, HUGE DECK, OVER-SIZED SHED/OUTBUILDING ALL ON ABSOLUTELY BEAUTIFUL/STUNNING/DEEP .50 WOODED ACRE LOT LITERALLY MINUTES TO MIDDLEBURY KAYAK/BOAT LAUNCH, FREEDOM TRAIL BIKE & HIKE TRAIL AND METRO/FIRST ENERGY BIKE & HIKE TRAIL (GOES TO PENINSULA--INCLUDES MOUNTAIN BIKE TRAILS/JUMPS IN WOODS!  ALSO LITERALLY 5 MIN TO BOTH NEWER STOW/KENT AND COLLEGE TOWN KENT/ACORN ALLEY SHOPPING PLAZAS & EATERIES!! HOME FEATURES INVITING FOYER; EXTRA-LARGE DINING ROOM WITH 6 RECESSED LIGHTS; TO-DIE-FOR CHEF'S DELIGHT GRANITE EAT-IN KITCHEN WITH DOUBLE PANTRY, DEEP 2-SIDED PREP SINK & DOUBLE-WIDE SUBWAY-TILED BACKSPLASH; OFFICE; LARGE FAMILY ROOM WITH BRUNCO WOOD-BURNING STOVE (COULD HEAT MOST OF HOME) & RECLAIMED BARN-BEAMED MANTEL OVERLOOKING BOTH KITCHEN & MULTI-WINDOWED SUN ROOM. 1/2 BATH.  ENTIRE BACK OF HOME HAS DREAMY REAR VIEWS OF THE WOODED REAR YARD.  HOME INCLUDES AWESOME OWNER SUITE WITH TWIN CLOSETS OVERLOOKING REAR YARD; 2 ADDITIONAL GREAT-SIZED BEDROOMS WITH EQUALLY GOOD-SIZED CLOSETS AND VERY COOL/SWANK COMMERCIAL GRADE MOSAIC/PORCELAIN-TILED BATH/SHOWER. NEWER HARDWOOD FLOORS THROUGH OUT EXCEPT FOR SUN ROOM AND BEDROOMS.  AWARD-WINNING KENT SCHOOLS.  LOCATION, LOCATION, LOCATION...BUT IT ALSO HAS ALL OF THE AMENITIES TOO!...BETTER THAN NEW CONSTRUCTION!! --NO SMALL GARAGE NOR POSTAGE-SIZED LOT--MAKE IT YOURS TODAY!!!", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "890 Marilyn Dr", "year_built": 1968, "bed": 3, "bath": 2, "ptype": "Single Family Home", "price": 165000, "sqft": 1744, "desc": "Welcome Home!  This unique home has all the room a person could ask for!  Nice sized rooms with so many possibilities. The living area has a majestic wood burning fireplace for cold Ohio winters and central air to keep you cool during the summer months.  The family room has access to the back patio with a view of a well manicured backyard, and to bring some of the greenery of outdoors inside, there is a fabulous brick planters box separating the kitchen and family room area.  Roof and windows replaced within the last 5 years. New hot water heater.  Kitchen flooring replaced in 2019. 2 1/2 car garage with abundant storage.     All this house needs is your modern touches to make it the perfect place to call home.", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "439 Majors Ln", "year_built": 1991, "bed": 4, "bath": 3, "ptype": "Single Family Home", "price": 269000, "sqft": 2385, "desc": "Custom built, welcoming, spotless and meticulously maintained are a few words to describe this 4 bedroom home.  Enter the hard wood, open foyer to find the incredible great room accented with a beautiful gas fireplace and built ins.  French doors lead you to a vaulted sun room with hardwood floors and plenty of windows creating for an abundance of natural light.  The spacious kitchen offers plenty of cabinet and counter space, has under cabinet lighting, is open to the eating/dining area, and offers a pantry, corian counters and newer refrigerator and gas stove.  The first floor also features the master bedroom/full bath with walk in shower, laundry, and office or den.  The office could be a 5th bedroom if needed.  Six panel solid hard wood doors, wide moldings and taller than normal baseboards are extra features unique to this home.  You will not believe the walk in closets in 2 of the bedrooms on the 2nd level (one is 14 x 7 and another 18 x 10)!  The finished lower level is extremely nice as well and has a full bath, wet bar, cedar closet and utility sink room.  Off the sun room is a nice deck with private backyard, patio and built in gas grill to enjoy this summer. Newer shed.  If you are looking for first floor living, this home is a must see.  Home warranty is offered for peace of mind.  Updates include:  New carpeting on steps and 2nd floor - June, 2020; Gas stove - Sept, 2017; Shed - May, 2015; Leaf Fitter Gutter Guard - May, 2013; Furnace and AC - 2011; Roof- 2004", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "216 West Elm St", "year_built": 1880, "bed": 2, "bath": 1, "ptype": "Single Family Home", "price": 69000, "sqft": 734, "desc": "Nice starter home or investment opportunity. Updated furnace and hot water tank. Very cute inside. Call today for showing. Tenant occupied.", "nbhd": "Downtown Kent"},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "2721 Lynn Rd", "year_built": 1960, "bed": 3, "bath": 3, "ptype": "Single Family Home", "price": 249900, "sqft": 1672, "desc": "Do you need a separate \"in-law suite\" or full apartment?  Do you want privacy and a few acres?  If so, you have just come to the right house! Click the link above that will take you to a 3D virtual tour of the home.  This lovely ranch offers 3 bedrooms upstairs (owners suite has a half bath), and an additional bedroom and living space with a kitchen off the garage on the lower level.  There is a fireplace in the eat in kitchen. An office off the kitchen keeps the new \"work from home\" people quiet away from the rest of the house, yet close enough to multi-task.  How about the bonus that the house gets free gas since there is a gas well on the property?  It also feeds a natural gas home generator that comes with the home!  The current owner made many repairs and changes to the home since they bought it. Here is your opportunity to get county living, yet stay close to everything.", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "3782 Olmsby Dr", "year_built": 1977, "bed": 3, "bath": 2, "ptype": "Single Family Home", "price": 117500, "sqft": 864, "desc": "This house is the perfect starter home or investment property. Well built just add your own finishing touches. Priced to sell!", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "Deer Trace", "year_built": 2004, "bed": 3, "bath": 3, "ptype": "Condominium Unit", "price": 185000, "sqft": 1416, "desc": "The government sponsored agencies Fannie Mae or Freddie Mac own this property after foreclosing on the original owner. Fannie Mae and Freddie Mac are chartered by the U.S. government to help families of low- and moderate-income to become homeowners. A published list price is stated but any reasonable offer may be considered. Offers go through the published listing agent. This contact can provide more details about this property, as well as the current special financing programs that may be available through Fannie Mae or Freddie Mac.", "nbhd": "Brady Lake"},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "4650 Estes Dr", "year_built": 1973, "bed": 3, "bath": 2, "ptype": "Single Family Home", "price": 204900, "sqft": 1968, "desc": "Stunning updated 3 bedroom, 2 full bath home on a picturesque .72 acre wooded private property. This beautiful split level boasts an Open Floor plan that includes a large Vaulted Dining Room and Living Room with a handsome brick fireplace. Newer meticulous White Kitchen updated in 2017 that includes lots of cabinets, stainless steel appliances, and ceramic plank tile. Sliding doors open to the fantastic 3 Season Sunroom with gas fireplace and new laminate flooring. \nThe Sunroom offers stunning views of the private backyard. A large wood deck and a patio are perfect for outdoor entertaining. The backyard includes two sheds, one with electric, great storage and workshop space. The second floor includes a large Master Suite with two closets and a private bath including a tiled shower. Two more bedrooms and a second full tiled bath complete the second floor.  A finished lower level with access from the two-car garage boasts a large recreation space, a laundry room, and lots of storage. Additional Updates include... 2019 Hot Water tank, 2015 Waterproofing System, Garage Door and Opener, 2017 Furnace and A/C, newer trim and 6-panel doors throughout, 2020 New Carpet throughout most of the home. Newer Wood Privacy Fence, 2018,  surrounds the entire backyard. Truly a well cared for home.", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "636 Emich Dr", "year_built": 1970, "bed": 5, "bath": 4, "ptype": "Single Family Home", "price": 246500, "sqft": 2844, "desc": "This gorgeous 5 bed/3.5 bath Colonial in the heart of the much sought-after subdivision of Riverside is the perfect home for entertaining! Fresh paint inside & new roof in 2014, new furnace & AC in 2016, new carpet throughout & new garbage disposal in 2018, new sump pump in 2019 & new stove & dishwasher in 2020. USA Waterproofing did the basement in 2019 & lifetime warranty transfers to new owners. Walk through the front door & to the right is a huge eat-in kitchen w/ an unbelievable amount of counter/cupboard space, wine rack, island on wheels & pass-through window to the family room. To the left is an incredibly spacious formal living room & dining room. The dining room has French doors leading to a wrap-around deck/Pergola. The immense family room has a wood-burning fireplace w/ two additional sets of French doors leading to the deck. There is also a gazebo & large shed for additional storage. Master bedroom is enormous w/ cathedral ceilings & two walk-in closets. Master bath has tub/shower combo & jet-spa garden tub. There are four additional upstairs bedrooms; two of which have built-in shelves and/or closets; and two of which have cork walls to display messages, pictures & artwork. The basement has two bonus rooms; one of which has a wet bar. There is also a full bath and workshop/utility room. This home is close to the Summit Bike & Hike Trail, shopping, dining, public transportation, major highways, airports, institutions of higher learning and so much more!", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "234 Shaw Dr", "year_built": 2016, "bed": 2, "bath": 2, "ptype": "Condominium Unit", "price": 284900, "sqft": 1856, "desc": "Just open the door and move into this exquisite turn key ranch with upgrades galour . Open floor concept , Dramatic\nvaulted Great room that features gas log fireplace, ceiling fan. Enjoy the bright and airy 4 season sun room. Large\ndining room with beautiful custom barnwood feature wall . The chefs kitchen features a sun tunnel that brings in\nbeautiful sunshine , granite countertops , under cabinet lighting , breakfast bar, cabinets galour. first floor laundry\nand ample storage. Master bedroom suite is vaulted and boasts a beautiful master bath with double vanity , granite counter tops, private\nshower ,linen closet and walk in closet, ceiling sun tunnel brings in the natural light. the garage is heated and has an\nepoxy floor that makes the garage a sanctuary for your vehicals. Private views to enjoy on the patio.\nThe home interior has just been professionally painted , the upgrades included in this build were spectacular. Just\nmove in and say I'm home! The community provides exclusive access to the Clubhouse , heated pool, a 24/7 fitness\ncenter, and a beautifully furnished social room complete with full entertainers kitchen, billiards, large screen TV, and\nmany hosted social events throughout", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "415 Gougler Ave", "year_built": 1835, "bed": 4, "bath": 2, "ptype": "Multi-family", "price": 1, "sqft": 1491, "desc": "AUCTION - One duplex on river.  PUBLIC AUCTION AUG. 1, 2020 @ 10:00 am.  \"AS-IS\" , WHERE AS WITH NO REPRESENTATIONS OR WARRANTIES.  A 10% Buyers premium to be added to bid to establish sales price, 10% deposit, balance in 30 days.  WILL BE SOLD SEPARATE & TOGETHER with  2nd auction @ 425 Gougler.  All information at auction takes precedent over listing information from sources to be true but not guaranteed.  PROPERTY WILL BE OPEN 1 HR. PRIOR TO SALE.", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "Newton Rd", "year_built": 0, "bed": 0, "bath": 0, "ptype": "Raw Land", "price": 69900, "sqft": 0, "desc": "Situated off Hudson Drive on Newton Road in Franklin Township, Kent, Ohio this awesome 1.5 acre property is grassed lawn in the front and partially cleared/mowed yet wooded in back. Land slopes to rear and west side of property. PERC soil test has been ordered/completed by buyer and is available from your realtor. Electric and gas at street. Well & septic to be installed by buyer. Build in the wooded or in front of them. Either way, build to suit on this gorgeous property! Buyer to perform due diligence re: Franklin Twsp &/or Portage County Building requirements/restrictions/easements/point of sale requirements before writing an offer to purchase. 167' of frontage & 423' depth. Handy to Kent and yet great country living!", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "591 South Francis St", "year_built": 1940, "bed": 2, "bath": 1, "ptype": "Single Family Home", "price": 99500, "sqft": 776, "desc": "Adorable 2 bed, move in ranch in Kent!  Comes with oversized 1 car garage ( 2 parking places ) and 12x15 rear private deck, accompanied by a step down stone patio.  All on a double lot with mature trees and foliage for some back yard fun!  Main systems updates occurred near 2002.  New Carpet, kitchen appliance upgrades and freshly painted interior.  Right down the road is Longcoy Elementary. Close to Kent State University, the beautifully renovated campus district, shops, walking trails, restaurants and all it has to offer!  Seller is providing a home warranty for added peace of mind.", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "1397 Brookdale Ln", "year_built": 1960, "bed": 4, "bath": 2, "ptype": "Single Family Home", "price": 126500, "sqft": 1170, "desc": "Nicely updated four-bedroom family home! New fully applianced kitchen, open to dining and living areas! New flooring throughout, newer furnace and hot water heater. Two refurbished full baths and laundry area-washer and dryer included! Slider leads to concrete back patio and large fully fenced backyard. Two car garage with workbench and built-in shelving. Concrete front porch overlooks pretty and sort of private pine-treed front yard! Garage roof approx. 2 years. Home roof approx. 7 years.", "nbhd": null},
{"city": "Kent", "state": "OH", "zipcode": "44240", "address": "5076 State Route 43", "year_built": 1942, "bed": 3, "bath": 1, "ptype": "Single Family Home", "price": 135000, "sqft": 1392, "desc": "Check out this cozy Cape Cod on a beautiful lot here in Brimfield Township. This 3 Bedroom/1 Bathroom home has so much to offer. Outside of the house you will find a barn and two additional sheds. Also outside of the home is a deck great for entertaining. Some updates include: Hot Water Tank 2016, New Carpeting 2013, New Roof 2011, and New Furnace 2009. Set up your showing today!", "nbhd": null}
]